{"op_to_idx": {"select": 1, "all_different": 2, "all_same": 3, "and": 4, "relate": 5, "filter": 6, "choose_attr": 7, "choose_rel": 8, "compare": 9, "exist": 10, "or": 11, "query_attr": 12, "two_different": 13, "two_same": 14, "verify_attrs": 15, "verify_rel": 16}, "idx_to_op": ["select", "all_different", "all_same", "and", "relate", "filter", "choose_attr", "choose_rel", "compare", "exist", "or", "query_attr", "two_different", "two_same", "verify_attrs", "verify_rel"], "arg_to_idx": {"no": 1, "person": 2, "gender": 3, "animal": 4, "type": 5, "yes": 6, "collar": 7, "bicycle": 8, "glasses": 9, "to the left of": 10, "true": 11, "man": 12, "sitting": 13, "bike": 14, "cone": 15, "couch": 16, "pillow": 17, "red": 18, "rectangular": 19, "coat": 20, "ski": 21, "oven": 22, "toaster": 23, "grass": 24, "snow": 25, "monitor": 26, "small": 27, "mouse pad": 28, "on top of": 29, "device": 30, "racket": 31, "sofa": 32, "bookcase": 33, "sink": 34, "white": 35, "bathtub": 36, "boy": 37, "bag": 38, "black": 39, "backpack": 40, "cloth": 41, "remote control": 42, "plastic": 43, "charger": 44, "computer mouse": 45, "camera": 46, "cell phone": 47, "woman": 48, "shirt": 49, "short sleeved": 50, "cotton": 51, "bed": 52, "table": 53, "above": 54, "lamp": 55, "picture": 56, "to the right of": 57, "curtain": 58, "soft": 59, "chair": 60, "bookshelf": 61, "skateboard": 62, "toilet": 63, "elephant": 64, "child": 65, "banana": 66, "container": 67, "restaurant": 68, "in": 69, "wood": 70, "pizza box": 71, "under": 72, "glove": 73, "snowboard": 74, "plate": 75, "girl": 76, "happy": 77, "sand": 78, "food": 79, "bear": 80, "bird": 81, "green": 82, "sheet": 83, "pillowcase": 84, "blond": 85, "helmet": 86, "planter": 87, "window": 88, "door": 89, "sweater": 90, "jacket": 91, "performing trick": 92, "male": 93, "talking": 94, "waiting": 95, "dark": 96, "tree": 97, "in front of": 98, "bench": 99, "full": 100, "behind": 101, "closet": 102, "stuffed bear": 103, "coffee table": 104, "smiling": 105, "frame": 106, "below": 107, "uniform": 108, "blue": 109, "hat": 110, "caucasian": 111, "young": 112, "skinny": 113, "looking up": 114, "thin": 115, "car": 116, "old": 117, "tie": 118, "mug": 119, "cup": 120, "donut": 121, "biscuit": 122, "television": 123, "short": 124, "appliance": 125, "clean": 126, "microwave": 127, "on": 128, "empty": 129, "mud": 130, "stainless steel": 131, "pan": 132, "beside": 133, "saucer": 134, "horse": 135, "lamb": 136, "light brown": 137, "shelf": 138, "fence": 139, "near": 140, "mirror": 141, "standing": 142, "bus": 143, "cd": 144, "tall": 145, "tape": 146, "umpire": 147, "keyboard": 148, "painting": 149, "can": 150, "notebook": 151, "ball": 152, "player": 153, "stove": 154, "open": 155, "airplane": 156, "truck": 157, "batter": 158, "catcher": 159, "dishwasher": 160, "face mask": 161, "metal": 162, "off": 163, "dog": 164, "kitten": 165, "towel": 166, "fire hydrant": 167, "motorcycle": 168, "utensil": 169, "hard": 170, "fork": 171, "knife": 172, "silver": 173, "cabinet": 174, "desk": 175, "book": 176, "sheep": 177, "gorilla": 178, "walking": 179, "goat": 180, "laptop": 181, "bat": 182, "long": 183, "nightstand": 184, "counter": 185, "square": 186, "coffee maker": 187, "tank top": 188, "nike": 189, "striped": 190, "sweatshirt": 191, "cake": 192, "berry": 193, "staring": 194, "umbrella": 195, "stroller": 196, "stuffed dog": 197, "kite": 198, "computer": 199, "skateboarder": 200, "number": 201, "new": 202, "floor": 203, "countertop": 204, "underneath": 205, "beach umbrella": 206, "microwave oven": 207, "boat": 208, "rope": 209, "dress shirt": 210, "bread": 211, "narrow": 212, "skate park": 213, "purse": 214, "orange": 215, "peach": 216, "still": 217, "reading": 218, "spice": 219, "bowl": 220, "dirty": 221, "salt shaker": 222, "wide": 223, "lying": 224, "adult": 225, "sad": 226, "closed": 227, "cupboard": 228, "drawer": 229, "crouching": 230, "gray": 231, "large": 232, "refrigerator": 233, "brown": 234, "vase": 235, "shorts": 236, "spoon": 237, "mashed potato": 238, "sign": 239, "bouquet": 240, "eggplant": 241, "purple": 242, "cabbage": 243, "fireplace": 244, "calm": 245, "pants": 246, "jeans": 247, "clock": 248, "yellow": 249, "covered": 250, "guitar": 251, "cow": 252, "poster": 253, "asian": 254, "hair clip": 255, "toothbrush": 256, "faucet": 257, "water bottle": 258, "looking down": 259, "comfortable": 260, "coffee mug": 261, "round": 262, "ladder": 263, "scarf": 264, "lady": 265, "tennis ball": 266, "antique": 267, "basket": 268, "apple": 269, "wallet": 270, "train": 271, "platform": 272, "next to": 273, "bathroom": 274, "shower": 275, "fire truck": 276, "traffic light": 277, "pot": 278, "baseball": 279, "pink": 280, "doll": 281, "blind": 282, "wine glass": 283, "wine bottle": 284, "wii controller": 285, "dress": 286, "skirt": 287, "side table": 288, "spatula": 289, "street sign": 290, "urinal": 291, "porcelain": 292, "speaker": 293, "baseball bat": 294, "penguin": 295, "pastry": 296, "cat": 297, "paper": 298, "parent": 299, "female": 300, "giraffe": 301, "vest": 302, "headphone": 303, "cowboy hat": 304, "strawberry": 305, "pizza": 306, "menu": 307, "flower": 308, "box": 309, "soap dispenser": 310, "glass": 311, "electric": 312, "cyclist": 313, "blueberry": 314, "fat": 315, "heavy": 316, "artwork": 317, "tea kettle": 318, "outdoors": 319, "screen": 320, "drink": 321, "leather": 322, "frisbee": 323, "pecan": 324, "serving tray": 325, "napkin": 326, "carrot": 327, "wetsuit": 328, "surfboard": 329, "long sleeved": 330, "coach": 331, "sailboat": 332, "tablecloth": 333, "policeman": 334, "carpet": 335, "chimney": 336, "soccer ball": 337, "flag": 338, "packet": 339, "jersey": 340, "cap": 341, "traffic sign": 342, "phone": 343, "eating": 344, "playing": 345, "step": 346, "folding chair": 347, "t-shirt": 348, "soccer player": 349, "running": 350, "thick": 351, "waffle": 352, "fresh": 353, "cookie": 354, "vegetable": 355, "bean": 356, "water": 357, "bridge": 358, "post": 359, "vehicle": 360, "computer monitor": 361, "resting": 362, "pretty": 363, "chopstick": 364, "sandwich": 365, "mango": 366, "parking meter": 367, "zebra": 368, "mattress": 369, "suv": 370, "parrot": 371, "dresser": 372, "van": 373, "knee pad": 374, "elbow pad": 375, "modern": 376, "grape": 377, "trash can": 378, "skier": 379, "tractor": 380, "tomato": 381, "kettle": 382, "safety jacket": 383, "statue": 384, "calculator": 385, "pizza slouse": 386, "blouse": 387, "posing": 388, "chicken": 389, "cash register": 390, "cupcake": 391, "old fashioned": 392, "suitcase": 393, "bottle": 394, "candle": 395, "bell": 396, "gift": 397, "skater": 398, "calf": 399, "field": 400, "spectator": 401, "baseball player": 402, "leafy": 403, "cauliflower": 404, "boot": 405, "blanket": 406, "hamburger": 407, "dugout": 408, "palm tree": 409, "wall": 410, "alarm clock": 411, "ice maker": 412, "toilet paper": 413, "telephone pole": 414, "skiing": 415, "mother": 416, "mat": 417, "dish drainer": 418, "tray": 419, "gentleman": 420, "router": 421, "dark brown": 422, "deer": 423, "dolphin": 424, "pepper": 425, "puppy": 426, "washing machine": 427, "soup": 428, "meat": 429, "mannequin": 430, "sock": 431, "word": 432, "high": 433, "tan": 434, "wine": 435, "scooter": 436, "driving": 437, "tissue box": 438, "pepper shaker": 439, "picture frame": 440, "soap": 441, "attached": 442, "colorful": 443, "steel": 444, "ambulance": 445, "shuttle": 446, "rug": 447, "pale": 448, "sleeping": 449, "rough": 450, "surfer": 451, "goal": 452, "broom": 453, "potato": 454, "necklace": 455, "bracelet": 456, "shield": 457, "fruit": 458, "cheese": 459, "lettuce": 460, "fry": 461, "shiny": 462, "bending": 463, "computer desk": 464, "guy": 465, "building": 466, "jet": 467, "teddy bear": 468, "uncomfortable": 469, "tissue": 470, "khaki": 471, "crate": 472, "bucket": 473, "cherry": 474, "rice": 475, "salad": 476, "pilot": 477, "tent": 478, "brownie": 479, "light": 480, "doorway": 481, "light fixture": 482, "house": 483, "bar stool": 484, "tv stand": 485, "bald": 486, "sandal": 487, "cooked": 488, "olive": 489, "unoccupied": 490, "photographer": 491, "magazine": 492, "stop sign": 493, "she": 494, "chocolate": 495, "baby": 496, "ice": 497, "moose": 498, "radio": 499, "electronic": 500, "snowboarder": 501, "blender": 502, "athletic": 503, "bun": 504, "gold": 505, "paper dispenser": 506, "gun": 507, "bull": 508, "antelope": 509, "whipped cream": 510, "athlete": 511, "suit": 512, "inside": 513, "ice cube": 514, "entertainment center": 515, "dvd player": 516, "object": 517, "taxi": 518, "coffee pot": 519, "life jacket": 520, "brunette": 521, "light bulb": 522, "parked": 523, "camel": 524, "kitchen": 525, "bedspread": 526, "cart": 527, "nut": 528, "bath towel": 529, "denim": 530, "shower curtain": 531, "broccoli": 532, "vendor": 533, "football": 534, "crown": 535, "outlet": 536, "american flag": 537, "home plate": 538, "dark blue": 539, "street": 540, "sticker": 541, "officer": 542, "leggings": 543, "dinosaur": 544, "flat": 545, "pen": 546, "dumpster": 547, "monkey": 548, "dragonfly": 549, "coffee": 550, "beige": 551, "sprinkle": 552, "student": 553, "black and white": 554, "cane": 555, "onion ring": 556, "made": 557, "hippo": 558, "briefcase": 559, "almond": 560, "toilet brush": 561, "tool": 562, "ottoman": 563, "balloon": 564, "comforter": 565, "flamingo": 566, "printer": 567, "console": 568, "bagel": 569, "trash bag": 570, "pipe": 571, "light blue": 572, "dry-erase board": 573, "figurine": 574, "train track": 575, "smooth": 576, "toy": 577, "boar": 578, "shoe": 579, "tenni": 580, "false": 581, "abundant": 582, "having meeting": 583, "lying on top of": 584, "furniture": 585, "ripe": 586, "peeled": 587, "unripe": 588, "top": 589, "bottom": 590, "wet": 591, "right": 592, "left": 593, "sitting atop": 594, "luggage": 595, "sitting in front of": 596, "sleeveless": 597, "radiator": 598, "opaque": 599, "concrete": 600, "adida": 601, "wavy": 602, "choppy": 603, "surfing": 604, "dry": 605, "riding": 606, "triangular": 607, "scissors": 608, "wooden": 609, "spray bottle": 610, "hair": 611, "sky": 612, "cloudy": 613, "this": 614, "rotten": 615, "he": 616, "touching": 617, "parked behind": 618, "sitting on top of": 619, "jar": 620, "scene": 621, "sunny": 622, "crane": 623, "coffee cup": 624, "living room": 625, "jumping": 626, "bare": 627, "paved": 628, "sidewalk": 629, "unpaved": 630, "stone": 631, "little": 632, "tail": 633, "bushy": 634, "holding": 635, "snow pants": 636, "clear": 637, "raw": 638, "snack": 639, "dining table": 640, "chrome": 641, "pear": 642, "dip": 643, "pitcher": 644, "around": 645, "huge": 646, "drinking": 647, "sneaker": 648, "cobblestone": 649, "forest": 650, "ground": 651, "leaf": 652, "cylindrical": 653, "swimming": 654, "sitting at": 655, "driver": 656, "dessert": 657, "bush": 658, "wheel": 659, "decorated with": 660, "pointing": 661, "cushioned": 662, "city": 663, "village": 664, "lush": 665, "leafless": 666, "trailer": 667, "road": 668, "plant": 669, "rainbow colored": 670, "of": 671, "indoors": 672, "office": 673, "store": 674, "looking at": 675, "beach": 676, "sandy": 677, "soccer": 678, "rocky": 679, "river": 680, "preparing": 681, "watch": 682, "fast food": 683, "path": 684, "ugly": 685, "teal": 686, "beautiful": 687, "bamboo": 688, "wool": 689, "foggy": 690, "newspaper": 691, "window frame": 692, "handbag": 693, "burner": 694, "cooking utensil": 695, "cutting board": 696, "park": 697, "metallic": 698, "mountain": 699, "mustard bottle": 700, "spinach": 701, "melted": 702, "net": 703, "dirt": 704, "label": 705, "maroon": 706, "wicker": 707, "snowy": 708, "snowboarding": 709, "shopping center": 710, "cloud": 711, "tiny": 712, "asphalt": 713, "brick": 714, "lid": 715, "sauce": 716, "cream colored": 717, "clothing": 718, "bright": 719, "tinted": 720, "sitting inside": 721, "lake": 722, "paper towel": 723, "checkered": 724, "dense": 725, "dotted": 726, "healthy": 727, "sitting on": 728, "holding onto": 729, "watching": 730, "ceiling": 731, "pencil": 732, "marker": 733, "cardboard": 734, "bedroom": 735, "gown": 736, "tree leaf": 737, "yard": 738, "alcohol": 739, "grassy": 740, "ocean": 741, "helicopter": 742, "farm": 743, "logo": 744, "ostrich": 745, "arrow": 746, "office chair": 747, "hay": 748, "wrapped around": 749, "parking lot": 750, "mesh": 751, "sparse": 752, "rose": 753, "controller": 754, "crowd": 755, "onion": 756, "unhealthy": 757, "serving dish": 758, "granite": 759, "sour cream": 760, "cable": 761, "hill": 762, "puffy": 763, "aluminum": 764, "oven door": 765, "heel": 766, "leaning on": 767, "down": 768, "overcast": 769, "heater": 770, "donkey": 771, "angry": 772, "ice cream": 773, "vanilla": 774, "flower pot": 775, "skateboarding": 776, "graffiti": 777, "skating": 778, "low": 779, "bus driver": 780, "grill": 781, "tire": 782, "resting on": 783, "tea pot": 784, "rubber": 785, "squash": 786, "clothe": 787, "horizontal": 788, "sausage": 789, "standing on top of": 790, "toothpaste": 791, "plugged into": 792, "railroad": 793, "tunnel": 794, "paddle": 795, "hot dog": 796, "cloudless": 797, "paper container": 798, "ring": 799, "wristband": 800, "decorated": 801, "pedestrian": 802, "apartment building": 803, "dining room": 804, "stormy": 805, "sitting beside": 806, "unlit": 807, "performer": 808, "reflective": 809, "unpeeled": 810, "working on": 811, "marshmallow": 812, "sign post": 813, "partly cloudy": 814, "iron": 815, "fan": 816, "connected to": 817, "bottle cap": 818, "pole": 819, "vintage": 820, "hardwood": 821, "ceramic": 822, "clay": 823, "tile": 824, "pasture": 825, "sitting in": 826, "staircase": 827, "greasy": 828, "fried": 829, "using": 830, "straw": 831, "beneath": 832, "playing at": 833, "walking near": 834, "standing beside": 835, "pine tree": 836, "soap bottle": 837, "copper": 838, "baseball mitt": 839, "chandelier": 840, "regular": 841, "irregular": 842, "apron": 843, "cord": 844, "hotel": 845, "power line": 846, "wheelchair": 847, "gas stove": 848, "wire": 849, "pickle": 850, "crispy": 851, "sculpture": 852, "bleacher": 853, "curly": 854, "straight": 855, "instrument": 856, "swimsuit": 857, "marble": 858, "cream": 859, "digital": 860, "license plate": 861, "curved": 862, "egg": 863, "rainy": 864, "baked": 865, "minivan": 866, "ipod": 867, "knife block": 868, "mask": 869, "zoo": 870, "crosswalk": 871, "reflecting in": 872, "mixer": 873, "bison": 874, "wolf": 875, "hanging above": 876, "luggage cart": 877, "drape": 878, "silverware": 879, "fine": 880, "murky": 881, "octagonal": 882, "staring at": 883, "rhino": 884, "pig": 885, "bandana": 886, "petting": 887, "real": 888, "at": 889, "pasta": 890, "storage box": 891, "shallow": 892, "squirrel": 893, "vacuum": 894, "room": 895, "up": 896, "pavement": 897, "lawn": 898, "headband": 899, "furry": 900, "ship": 901, "on the edge of": 902, "rock": 903, "stadium": 904, "trunk": 905, "ham": 906, "stained": 907, "sitting behind": 908, "medicine cabinet": 909, "garage": 910, "dvd": 911, "leading": 912, "foil": 913, "busy": 914, "pineapple": 915, "typical": 916, "stage": 917, "deliciou": 918, "delicious": 919, "table lamp": 920, "shut": 921, "shop": 922, "sturdy": 923, "dull": 924, "cake stand": 925, "public": 926, "burger": 927, "simple": 928, "wildflower": 929, "warm": 930, "mailbox": 931, "unhappy": 932, "barn": 933, "train station": 934, "belt": 935, "oil": 936, "canister": 937, "lying on": 938, "toilet seat": 939, "folded": 940, "sitting next to": 941, "uncooked": 942, "school": 943, "brush": 944, "robe": 945, "stuffed": 946, "gate": 947, "eye glasses": 948, "soda": 949, "playing with": 950, "plaid": 951, "tasty": 952, "cooking": 953, "lace": 954, "perched on": 955, "sliced": 956, "laughing": 957, "underwear": 958, "filled with": 959, "illuminated": 960, "bronze": 961, "harbor": 962, "wrapped": 963, "professional": 964, "cut": 965, "xbox controller": 966, "hospital": 967, "powder": 968, "polo shirt": 969, "contain": 970, "chalkboard": 971, "sun": 972, "propeller": 973, "glazed": 974, "patterned": 975, "portable": 976, "pancake": 977, "toast": 978, "grouped": 979, "runway": 980, "with": 981, "stacked": 982, "on the front of": 983, "sprinkled": 984, "pie": 985, "wrinkled": 986, "canopy": 987, "shoe lace": 988, "hanging": 989, "wooded": 990, "tea": 991, "plain": 992, "patio": 993, "reflected in": 994, "sprinkled on": 995, "juice": 996, "video camera": 997, "bacon": 998, "lion": 999, "beard": 1000, "dock": 1001, "hillside": 1002, "framed": 1003, "larger than": 1004, "pepperoni": 1005, "wearing": 1006, "weapon": 1007, "sword": 1008, "surrounding": 1009, "soap dish": 1010, "garden": 1011, "decoration": 1012, "fur": 1013, "standing at": 1014, "pointing at": 1015, "double decker": 1016, "standing on": 1017, "deep": 1018, "candy": 1019, "panda": 1020, "adidas": 1021, "mountain side": 1022, "street light": 1023, "receipt": 1024, "styrofoam": 1025, "navy": 1026, "card": 1027, "tin": 1028, "market": 1029, "standing behind": 1030, "library": 1031, "decorated by": 1032, "baked good": 1033, "muffin": 1034, "leaning against": 1035, "curled": 1036, "crystal": 1037, "sleeping on": 1038, "padded": 1039, "hanging from": 1040, "trash": 1041, "fancy": 1042, "undershirt": 1043, "vertical": 1044, "roadway": 1045, "sitting around": 1046, "milk": 1047, "customer": 1048, "pizza pan": 1049, "liquor": 1050, "beer": 1051, "utensil holder": 1052, "baking pan": 1053, "hairy": 1054, "stair": 1055, "food container": 1056, "carrying": 1057, "star": 1058, "toilet lid": 1059, "airport": 1060, "mounted to": 1061, "fluffy": 1062, "front": 1063, "standing in front of": 1064, "middle": 1065, "facing": 1066, "ornament": 1067, "cutting": 1068, "standing near": 1069, "sitting near": 1070, "transparent": 1071, "hanging on": 1072, "walking toward": 1073, "driving on": 1074, "parked at": 1075, "looking down at": 1076, "riding on": 1077, "getting on": 1078, "pulled by": 1079, "wild": 1080, "growing from": 1081, "following": 1082, "swinging": 1083, "standing against": 1084, "walking up": 1085, "covering": 1086, "slicing": 1087, "skating on": 1088, "walking on": 1089, "parked along": 1090, "worn on": 1091, "running on": 1092, "talking on": 1093, "running in": 1094, "hitting": 1095, "traveling on": 1096, "hugging": 1097, "piled": 1098, "walking along": 1099, "playing in": 1100, "worn around": 1101, "walking by": 1102, "attached to": 1103, "bigger than": 1104, "surrounded by": 1105, "elevated": 1106, "standing around": 1107, "entrance": 1108, "raspberry": 1109, "larg": 1110, "covered by": 1111, "spider": 1112, "jockey": 1113, "dispenser": 1114, "worker": 1115, "carriage": 1116, "hairbrush": 1117, "wig": 1118, "sugar packet": 1119, "noodle": 1120, "desk lamp": 1121, "engineer": 1122, "parked on": 1123, "walking across": 1124, "placemat": 1125, "arched": 1126, "tortilla": 1127, "full of": 1128, "peacock": 1129, "display": 1130, "employee": 1131, "pulling": 1132, "bird house": 1133, "chef": 1134, "biker": 1135, "going into": 1136, "shopping cart": 1137, "diaper": 1138, "lipstick": 1139, "grinder": 1140, "hose": 1141, "baker": 1142, "beach chair": 1143, "reaching for": 1144, "cage": 1145, "apartment": 1146, "standing next to": 1147, "pliers": 1148, "growing in": 1149, "cucumber": 1150, "kiwi": 1151, "giant": 1152, "cigarette": 1153, "playing on": 1154, "cookbook": 1155, "on the back of": 1156, "bandage": 1157, "walnut": 1158, "towel dispenser": 1159, "mounted": 1160, "hammer": 1161, "walkway": 1162, "bird cage": 1163, "grazing": 1164, "mushroom": 1165, "tiger": 1166, "train car": 1167, "walking behind": 1168, "passenger": 1169, "lizard": 1170, "decorating": 1171, "binder": 1172, "scrub brush": 1173, "paint brush": 1174, "tag": 1175, "pizza tray": 1176, "growing behind": 1177, "cigar": 1178, "toolbox": 1179, "chess piece": 1180, "in between": 1181, "tablet": 1182, "picnic table": 1183, "cheese cube": 1184, "jumping off": 1185, "earring": 1186, "rubber duck": 1187, "log": 1188, "assorted": 1189, "son": 1190, "garland": 1191, "game controller": 1192, "duck": 1193, "rabbit": 1194, "coconut": 1195, "hand soap": 1196, "tower": 1197, "eagle": 1198, "tiled": 1199, "sponge": 1200, "hard drive": 1201, "seat": 1202, "grazing on": 1203, "microphone": 1204, "visitor": 1205, "napkin dispenser": 1206, "catching": 1207, "seagull": 1208, "envelope": 1209, "notepad": 1210, "parachute": 1211, "sack": 1212, "shaped": 1213, "battery": 1214, "end table": 1215, "locomotive": 1216, "dragon": 1217, "coin": 1218, "soldier": 1219, "fire extinguisher": 1220, "projector": 1221, "juice box": 1222, "kicking": 1223, "pizza slice": 1224, "ice-cream cone": 1225, "cake slouse": 1226, "electric toothbrush": 1227, "dish soap": 1228, "jeep": 1229, "butter": 1230, "flying in": 1231, "cooker": 1232, "jumping on": 1233, "tangled": 1234, "armor": 1235, "taller than": 1236, "tourist": 1237, "hotdog bun": 1238, "cracker": 1239, "pumpkin": 1240, "shopper": 1241, "steep": 1242, "bomb": 1243, "crossing": 1244, "dark colored": 1245, "on the bottom of": 1246, "lit": 1247, "alien": 1248, "lock": 1249, "swimming pool": 1250, "goose": 1251, "pigeon": 1252, "taco": 1253, "floating on": 1254, "mustard": 1255, "plier": 1256, "dryer": 1257, "parked alongside": 1258, "hand towel": 1259, "turtle": 1260, "worn": 1261, "spray can": 1262, "looking in": 1263, "tree branch": 1264, "floor lamp": 1265, "farmer": 1266, "barrier": 1267, "desktop computer": 1268, "toy car": 1269, "across from": 1270, "floating": 1271, "close to": 1272, "brass": 1273, "cabin": 1274, "cookie jar": 1275, "lying next to": 1276, "castle": 1277, "kneeling": 1278, "shampoo": 1279, "bartender": 1280, "swimmer": 1281, "light switch": 1282, "wine glasses": 1283, "snake": 1284, "light colored": 1285, "traveling down": 1286, "lemon": 1287, "hand dryer": 1288, "dream catcher": 1289, "owl": 1290, "decorative": 1291, "sharp": 1292, "stuffed animal": 1293, "whale": 1294, "seal": 1295, "machine": 1296, "parking sign": 1297, "chewing": 1298, "smaller than": 1299, "lighthouse": 1300, "antenna": 1301, "waste basket": 1302, "talking to": 1303, "octopu": 1304, "beer mug": 1305, "audience": 1306, "rooftop": 1307, "filled": 1308, "christmas light": 1309, "food truck": 1310, "parked next to": 1311, "woven": 1312, "panda bear": 1313, "covered in": 1314, "gourd": 1315, "egg roll": 1316, "looking over": 1317, "steak": 1318, "nest": 1319, "poodle": 1320, "rolling pin": 1321, "french toast": 1322, "watermelon": 1323, "cranberry": 1324, "courtyard": 1325, "wius": 1326, "comb": 1327, "waiter": 1328, "cheetah": 1329, "sitting under": 1330, "alert": 1331, "standing in": 1332, "shark": 1333, "milkshake": 1334, "papaya": 1335, "frog": 1336, "armchair": 1337, "toaster oven": 1338, "fisherman": 1339, "vending machine": 1340, "letter": 1341, "wagon": 1342, "desert": 1343, "temple": 1344, "snail": 1345, "whisk": 1346, "daughter": 1347, "buoy": 1348, "polar bear": 1349, "hair dryer": 1350, "cowboy": 1351, "celery": 1352, "clock tower": 1353, "piano": 1354, "bunny": 1355, "food processor": 1356, "grapefruit": 1357, "father": 1358, "roasted": 1359, "drum": 1360, "toddler": 1361, "peanut": 1362, "butterfly": 1363, "lego": 1364, "croissant": 1365, "beer can": 1366, "angry bird": 1367, "flatbread": 1368, "wardrobe": 1369, "palace": 1370, "beet": 1371, "color": 1372, "_": 1373, "name": 1374, "pose": 1375, "mounted on": 1376, "material": 1377, "activity": 1378, "same color": 1379, "weather": 1380, "size": 1381, "fatness": 1382, "height": 1383, "place": 1384, "state": 1385, "hposition": 1386, "length": 1387, "shape": 1388, "pattern": 1389, "over": 1390, "thickness": 1391, "age": 1392, "knit": 1393, "tone": 1394, "scattered on": 1395, "width": 1396, "depth": 1397, "same material": 1398, "cleanliness": 1399, "hardness": 1400, "written": 1401, "same shape": 1402, "collared": 1403, "flying above": 1404, "aircraft": 1405, "massive": 1406, "higher than": 1407, "watercraft": 1408, "scattered": 1409, "drinking from": 1410, "race": 1411, "throwing": 1412, "opening": 1413, "vast": 1414, "reflected on": 1415, "falling off": 1416, "company": 1417, "flying": 1418, "diamond": 1419, "banana bunch": 1420, "sleepy": 1421, "messy": 1422, "sportactivity": 1423, "painted on": 1424, "guiding": 1425, "stuck on": 1426, "weight": 1427, "turkey": 1428, "on the side of": 1429, "looking toward": 1430, "gravel": 1431, "vine": 1432, "growing along": 1433, "waiting for": 1434, "running across": 1435, "parked in front of": 1436, "hook": 1437, "hang from": 1438, "mound": 1439, "chopped": 1440, "about to hit": 1441, "posing with": 1442, "growing on": 1443, "oblong": 1444, "wristwatch": 1445, "jewelry": 1446, "walking next to": 1447, "seen through": 1448, "evergreen": 1449, "hanging off": 1450, "powerful": 1451, "half full": 1452, "they": 1453, "wading in": 1454, "sweet": 1455, "bunched": 1456, "neat": 1457, "manhole cover": 1458, "parked near": 1459, "going through": 1460, "plush": 1461, "frosted": 1462, "flying through": 1463, "athletic shoe": 1464, "branch": 1465, "eating from": 1466, "tight": 1467, "followed by": 1468, "fence post": 1469, "texture": 1470, "folding": 1471, "sewn on": 1472, "standing by": 1473, "goggles": 1474, "polished": 1475, "designed": 1476, "ga": 1477, "rounded": 1478, "pizza crust": 1479, "shining through": 1480, "sea foam": 1481, "coming from": 1482, "control panel": 1483, "looking out": 1484, "packaged": 1485, "parked beside": 1486, "jumping over": 1487, "flavor": 1488, "floating in": 1489, "tied around": 1490, "roof": 1491, "loose": 1492, "military": 1493, "map": 1494, "crowded": 1495, "translucent": 1496, "hidden by": 1497, "shirtless": 1498, "realism": 1499, "chubby": 1500, "curiou": 1501, "overhead": 1502, "tied": 1503, "lying in": 1504, "jagged": 1505, "strong": 1506, "name tag": 1507, "door frame": 1508, "stick": 1509, "air": 1510, "obstacle": 1511, "potted": 1512, "incomplete": 1513, "deciduou": 1514, "crooked": 1515, "weathered": 1516, "dried": 1517, "ornate": 1518, "dusty": 1519, "painted": 1520, "muscular": 1521, "printed": 1522, "mowed": 1523, "carpeted": 1524, "snow shoe": 1525, "sitting by": 1526, "platter": 1527, "oriental": 1528, "fallen": 1529, "neon": 1530, "lobster": 1531, "by": 1532, "skyscraper": 1533, "herb": 1534, "ketchup": 1535, "pouch": 1536, "gadget": 1537, "smoke": 1538, "steam": 1539, "outfit": 1540, "swan": 1541, "shopping bag": 1542, "canoe": 1543, "butter knife": 1544, "avocado": 1545, "lime": 1546, "omelette": 1547, "dish": 1548, "ramekin": 1549, "snowsuit": 1550, "alligator": 1551, "yogurt": 1552, "deck": 1553, "heart": 1554, "kangaroo": 1555, "bee": 1556, "crab": 1557, "parsley": 1558, "shrimp": 1559, "crust": 1560, "melon": 1561, "tongs": 1562, "seed": 1563, "pizza pie": 1564, "lunch box": 1565, "action figure": 1566, "terminal": 1567, "station": 1568, "basil": 1569, "asparagus": 1570, "ladle": 1571, "tangerine": 1572, "cotton dessert": 1573, "ketchup bottle": 1574, "pea": 1575, "leopard": 1576, "pizza cutter": 1577, "bell tower": 1578, "cereal": 1579, "zucchini": 1580, "bread box": 1581, "restroom": 1582, "blazer": 1583, "toasted": 1584, "coke": 1585, "mall": 1586, "pizza oven": 1587, "ear bud": 1588, "cream cheese": 1589, "raisin": 1590, "herd": 1591, "corn": 1592, "burrito": 1593, "rice cooker": 1594, "weed": 1595, "meal": 1596, "fake": 1597, "garlic": 1598, "beef": 1599, "ravioli": 1600, "pistachio": 1601, "waitress": 1602, "grilled": 1603, "raincoat": 1604, "barefoot": 1605, "on the other side of": 1606, "baking sheet": 1607, "artichoke": 1608, "grater": 1609, "pomegranate": 1610, "between": 1611, "sheer": 1612, "gummy bear": 1613, "rolled": 1614, "liquid": 1615, "wedding": 1616, "cheesecake": 1617, "roll": 1618, "stir fry": 1619, "beverage": 1620, "feta cheese": 1621, "pretzel": 1622, "tofu": 1623, "pond": 1624, "appetizer": 1625, "skillet": 1626, "bikini": 1627, "coleslaw": 1628, "cooking pot": 1629, "spear": 1630, "entree": 1631, "parmesan cheese": 1632, "porch": 1633, "blossom": 1634, "cooler": 1635, "elderly": 1636, "cluttered": 1637, "stapler": 1638, "mozzarella": 1639, "air conditioner": 1640, "daisy": 1641, "can opener": 1642, "hotel room": 1643, "casserole": 1644, "flmy": 1645, "trumpet": 1646, "sweet potato": 1647, "steamed": 1648, "honey": 1649, "cinnamon roll": 1650, "syrup": 1651, "kitchen towel": 1652, "water glass": 1653, "shampoo bottle": 1654, "dumpling": 1655, "head": 1656, "chocolate chip": 1657, "crumb": 1658, "salmon": 1659, "cheeseburger": 1660, "costume": 1661, "shore": 1662, "bedding": 1663, "guacamole": 1664, "roast beef": 1665, "jumpsuit": 1666, "package": 1667, "dinner": 1668, "earphone": 1669, "plantain": 1670, "vitamin": 1671, "pocket": 1672, "elmo": 1673, "tuna": 1674, "apple logo": 1675, "broth": 1676, "flip flop": 1677, "chickpea": 1678, "cereal box": 1679, "school bus": 1680, "chinese food": 1681, "beer bottle": 1682, "soda bottle": 1683, "hedge": 1684, "sunflower": 1685, "couple": 1686, "home": 1687, "cake pan": 1688, "peanut butter": 1689, "fruit stand": 1690, "candle holder": 1691, "pasta salad": 1692, "wireless": 1693, "loaf": 1694, "produce": 1695, "balcony": 1696, "chef hat": 1697, "bread loaf": 1698, "cross": 1699, "lemonade": 1700, "fuzzy": 1701, "diced": 1702, "sticky note": 1703, "tomato sauce": 1704, "blackberry": 1705, "rifle": 1706, "kiosk": 1707, "backyard": 1708, "chili": 1709, "pita": 1710, "mexican food": 1711, "oak tree": 1712, "pudding": 1713, "macaroni": 1714, "shredded": 1715, "fish": 1716, "soda can": 1717, "moss": 1718, "stew": 1719, "pajama": 1720, "wing": 1721, "puddle": 1722, "boiled": 1723, "dish towel": 1724, "intersection": 1725, "orchid": 1726, "balding": 1727, "chicken breast": 1728, "lamp shade": 1729, "hallway": 1730, "upholstered": 1731, "mixing bowl": 1732, "chain": 1733, "church": 1734, "icing": 1735, "mustache": 1736, "burnt": 1737, "beak": 1738, "shower door": 1739, "game": 1740, "nose": 1741, "eye": 1742, "gas station": 1743, "lip": 1744, "mane": 1745, "sugar": 1746, "sniffing": 1747, "bus stop": 1748, "wired": 1749, "mature": 1750, "immature": 1751, "buying": 1752, "sushi": 1753, "feather": 1754, "frosting": 1755, "dome": 1756, "headboard": 1757, "bent": 1758, "mint": 1759, "fountain": 1760, "horn": 1761, "stump": 1762, "walking with": 1763, "hand": 1764, "figure": 1765, "garage door": 1766, "homemade": 1767, "magnet": 1768, "exiting": 1769, "boarding": 1770, "rib": 1771, "birthday": 1772, "champagne": 1773, "dough": 1774, "fudge": 1775, "herding": 1776, "trying to catch": 1777, "halved": 1778, "feeder": 1779, "reflected": 1780, "blank": 1781, "funny": 1782, "price tag": 1783, "steering wheel": 1784, "squatting": 1785, "milk carton": 1786, "lined": 1787, "factory": 1788, "inflatable": 1789, "sail": 1790, "perched": 1791, "chasing": 1792, "displayed": 1793, "enclosing": 1794, "aquarium": 1795, "eating at": 1796, "rustic": 1797, "crusty": 1798, "island": 1799, "silk": 1800, "sealed": 1801, "biting": 1802, "anchovy": 1803, "speckled": 1804, "eaten": 1805, "ingredient": 1806, "wallpaper": 1807, "printed on": 1808, "satellite dish": 1809, "topping": 1810, "feeding": 1811, "licking": 1812, "mayonnaise": 1813, "helping": 1814, "floral": 1815, "drawing": 1816, "banana peel": 1817, "shelter": 1818, "topped with": 1819, "lunch": 1820, "kissing": 1821, "moon": 1822, "highway": 1823, "family": 1824, "marina": 1825, "stacked on": 1826, "lobby": 1827, "breakfast": 1828, "upside down": 1829, "wok": 1830, "potato chip": 1831, "hangar": 1832, "gravy": 1833, "shining": 1834, "garment": 1835, "coming out of": 1836, "draped over": 1837, "spread": 1838, "nutella": 1839, "hilltop": 1840, "soft drink": 1841, "riding in": 1842, "industrial": 1843, "sea": 1844, "garnish": 1845, "selling": 1846, "looking through": 1847, "ivory": 1848, "sleeping in": 1849, "typing on": 1850, "making": 1851, "cafe": 1852, "approaching": 1853, "roadside": 1854, "working in": 1855, "scrambled": 1856, "washing": 1857, "pointy": 1858, "pump": 1859, "egg yolk": 1860, "popcorn": 1861, "town": 1862, "served on": 1863, "oatmeal": 1864, "meatball": 1865, "monster": 1866, "museum": 1867, "theater": 1868, "flowered": 1869, "broken": 1870, "abandoned": 1871, "used": 1872, "blurry": 1873, "smiling at": 1874, "seafood": 1875, "grated": 1876, "rusty": 1877, "spot": 1878, "salad dressing": 1879, "meadow": 1880, "cordless": 1881, "shaving cream": 1882, "torn": 1883, "smelling": 1884, "waterfall": 1885, "flame": 1886, "mickey mouse": 1887, "curvy": 1888, "swamp": 1889, "moving": 1890, "salt": 1891, "leaving": 1892, "bug": 1893, "mixed with": 1894, "observing": 1895, "cliff": 1896, "seaweed": 1897, "pocket watch": 1898, "formal": 1899, "photographing": 1900, "twisted": 1901, "longer than": 1902, "towing": 1903, "cracked": 1904, "docked": 1905, "granola": 1906, "dog food": 1907, "auditorium": 1908, "lounge": 1909, "cat food": 1910, "cabinet door": 1911, "drawn": 1912, "tied to": 1913, "seasoned": 1914, "bakery": 1915, "juicy": 1916, "ginger": 1917, "textured": 1918, "sunglass": 1919, "sitting with": 1920, "curious": 1921, "snow boot": 1922, "merchandise": 1923, "french": 1924, "feathered": 1925, "protective": 1926, "hanging over": 1927, "leaning over": 1928, "cathedral": 1929, "manicured": 1930, "coarse": 1931, "creamy": 1932, "tilted": 1933, "pantry": 1934, "twig": 1935, "grabbing": 1936, "boulder": 1937, "mountain peak": 1938, "eiffel tower": 1939, "cappuccino": 1940, "glowing": 1941, "smoothie": 1942, "paint": 1943, "dressing": 1944, "tabby": 1945, "sliding": 1946, "toiletry": 1947, "pork": 1948, "crumpled": 1949, "faded": 1950, "elongated": 1951, "skin": 1952, "office supply": 1953, "calico": 1954, "ski lift": 1955, "snoopy": 1956, "face": 1957, "oreo": 1958, "iced": 1959, "hummus": 1960, "fire": 1961, "foreign": 1962, "fishing pole": 1963, "beetle": 1964, "cleaning": 1965, "stuck in": 1966, "walking to": 1967, "looking into": 1968, "browned": 1969, "support": 1970, "displayed on": 1971, "shaggy": 1972, "gas pump": 1973, "packed": 1974, "angled": 1975, "climbing": 1976, "commercial": 1977, "frozen": 1978, "team": 1979, "pushing": 1980, "character": 1981, "piled on": 1982, "cactu": 1983, "miniature": 1984, "vacant": 1985, "oversized": 1986, "mixed": 1987, "cinnamon": 1988, "scaffolding": 1989, "pill": 1990, "trimmed": 1991, "shaded": 1992, "serving": 1993, "wispy": 1994, "american": 1995, "spiral": 1996, "pesto": 1997, "waving": 1998, "outdoor": 1999, "raised": 2000, "crossed": 2001, "edged": 2002, "potato salad": 2003, "cockpit": 2004, "pillar": 2005, "vinegar": 2006, "melting": 2007, "muddy": 2008, "fog": 2009, "guest": 2010, "pastel": 2011, "robot": 2012, "elevator": 2013, "pushed by": 2014, "walking in": 2015, "complete": 2016, "thermometer": 2017, "symbol": 2018, "leg": 2019, "adjusting": 2020, "tossing": 2021, "gym": 2022, "covered with": 2023, "corded": 2024, "splashing": 2025, "glossy": 2026, "standing under": 2027, "disposable": 2028, "turned": 2029, "snow flake": 2030, "uneven": 2031, "salon": 2032, "cafeteria": 2033, "tropical": 2034, "clumped": 2035, "wrinkly": 2036, "glaze": 2037, "money": 2038, "kept in": 2039, "damaged": 2040, "quilted": 2041, "analog": 2042, "coffee shop": 2043, "ruffled": 2044, "tattoo": 2045, "handmade": 2046, "classroom": 2047, "powdered sugar": 2048, "olive oil": 2049, "lily": 2050, "chinese": 2051, "match": 2052, "shaved": 2053, "vinyl": 2054, "patchy": 2055, "connected": 2056, "wii game": 2057, "wrapped in": 2058, "video game": 2059, "toothpick": 2060, "riding boot": 2061, "blood": 2062, "keypad": 2063, "picking up": 2064, "scarce": 2065, "amusement park": 2066, "safety": 2067, "christmas": 2068, "ridged": 2069, "life preserver": 2070, "fenced": 2071, "sunlit": 2072, "artificial": 2073, "accessory": 2074, "entering": 2075, "pouring": 2076, "bead": 2077, "hanging out of": 2078, "parked in": 2079, "driving down": 2080, "walking down": 2081, "hung on": 2082, "in the center of": 2083, "parked by": 2084, "outside": 2085, "balancing on": 2086, "going down": 2087, "flying over": 2088, "walking through": 2089, "slanted": 2090, "hurdle": 2091, "skiing in": 2092, "grazing in": 2093, "coming down": 2094, "dragging": 2095, "rain": 2096, "skiing on": 2097, "cooked in": 2098, "hanging in": 2099, "tying": 2100, "eating in": 2101, "bubble": 2102, "growing by": 2103, "orchard": 2104, "in the middle of": 2105, "swimming in": 2106, "lying inside": 2107, "blowing out": 2108, "walking past": 2109, "brushing": 2110, "smoking": 2111, "running through": 2112, "touchpad": 2113, "pizza shop": 2114, "buffet": 2115, "overgrown": 2116, "supermarket": 2117, "blooming": 2118, "drawn on": 2119, "bone": 2120, "chained to": 2121, "along": 2122, "lab coat": 2123, "alongside": 2124, "jumping in": 2125, "walking into": 2126, "beyond": 2127, "cotton candy": 2128, "rippling": 2129, "sticking out of": 2130, "egg carton": 2131, "frying pan": 2132, "roman": 2133, "placed on": 2134, "at the edge of": 2135, "seat belt": 2136, "shingled": 2137, "growing near": 2138, "drain": 2139, "skiing down": 2140, "barren": 2141, "recessed": 2142, "grocery": 2143, "picnic": 2144, "foamy": 2145, "ceiling light": 2146, "winding": 2147, "across": 2148, "eraser": 2149, "at the end of": 2150, "spraying": 2151, "in the back of": 2152, "suspended": 2153, "power": 2154, "traffic": 2155, "growing next to": 2156, "cookie dough": 2157, "smoke stack": 2158, "pine": 2159, "barbed": 2160, "hazy": 2161, "groomed": 2162, "burning": 2163, "displayed in": 2164, "crisp": 2165, "lighted": 2166, "thing": 2167, "forested": 2168, "ornamental": 2169, "chipped": 2170, "palm": 2171, "fluorescent": 2172, "spiky": 2173, "direction": 2174, "dressed in yellow": 2175, "brushing tooth": 2176, "playing frisbee": 2177, "dressed in white": 2178, "dressed in blue": 2179, "playing tenni": 2180, "taking a photo": 2181, "playing wius": 2182, "none": 2183, "playing soccer": 2184, "dressed in black": 2185, "sculpted": 2186, "playing baseball": 2187, "playing game": 2188, "dressed in red": 2189, "looking straight": 2190, "breaking": 2191, "shaking hand": 2192, "facing left": 2193, "discolored": 2194, "taking a picture": 2195, "dressed in pink": 2196, "coral": 2197, "winter": 2198, "dressed in orange": 2199, "looking ahead": 2200, "caramel": 2201, "dressed in brown": 2202, "playing video game": 2203, "on the surface of": 2204, "playing music": 2205, "blowing": 2206, "taking picture": 2207, "polar": 2208, "lower": 2209, "16": 2210, "making a face": 2211, "attic": 2212, "looking left": 2213, "looking for food": 2214, "braided": 2215, "dressed in green": 2216, "out": 2217, "at the camera": 2218, "looking at the camera": 2219, "looking for": 2220, "dressed in purple": 2221, "facing right": 2222, "looking forward": 2223, "forward": 2224, "shorter than": 2225, "taking a photograph": 2226, "dressed in gray": 2227, "shadowed": 2228, "music": 2229, "carved": 2230, "floppy": 2231, "dressed in tan": 2232, "looking right": 2233, "kimono": 2234, "paneled": 2235, "crouched": 2236, "upper": 2237, "arm": 2238, "18": 2239, "25": 2240, "face expression": 2241, "ahead": 2242, "sconce": 2243, "away": 2244, "looking away": 2245, "27": 2246, "vibrant": 2247, "taking bath": 2248, "back": 2249, "dressed in beige": 2250, "dressed in khaki": 2251, "playing cricket": 2252, "cricket": 2253, "urban": 2254, "looking sideway": 2255, "sideway": 2256, "looking back": 2257, "dressed in light blue": 2258, "looking outside": 2259, "cemetery": 2260, "rippled": 2261, "crumbled": 2262, "within": 2263, "pulled back": 2264, "powdered": 2265, "coffee bean": 2266, "pub": 2267, "polo": 2268, "facing away": 2269, "upward": 2270, "looking upward": 2271, "looking downward": 2272, "cooking oil": 2273, "egg white": 2274, "looking behind": 2275, "rugged": 2276, "looking in the mirror": 2277, "in the mirror": 2278, "hollow": 2279, "crashing": 2280, "dressed in gold": 2281, "looking for the luggage": 2282, "pointing to": 2283, "knotted": 2284, "downward": 2285, "pointing up": 2286, "hibiscu": 2287, "31": 2288, "cast on shadow": 2289, "dressed in maroon": 2290, "inflated": 2291, "taking photo": 2292, "sport": 2293, "playing volleyball": 2294, "directional": 2295, "15": 2296, "the shoe": 2297, "looking for the shoe": 2298, "wave": 2299, "looking for wave": 2300, "looking for fish": 2301, "garbage": 2302, "playing basketball": 2303, "playing football": 2304, "24": 2305, "facing front": 2306, "patched": 2307, "the luggage": 2308, "turbine": 2309, "toilet bowl": 2310, "tree trunk": 2311, "telephone": 2312, "abstract": 2313, "looking": 2314, "backward": 2315, "citru": 2316, "at camera": 2317, "the same direction": 2318, "neck": 2319, "in mirror": 2320, "the camera": 2321, "batting": 2322, "pikachu": 2323, "pokemon": 2324, "horse hoof": 2325, "misty": 2326, "peeling": 2327, "looking for a wave": 2328, "a wave": 2329, "spinning": 2330, "taking note": 2331, "mouth": 2332, "tongue": 2333, "pointing upward": 2334, "paw": 2335}, "idx_to_arg": ["no", "person", "gender", "animal", "type", "yes", "collar", "bicycle", "glasses", "to the left of", "true", "man", "sitting", "bike", "cone", "couch", "pillow", "red", "rectangular", "coat", "ski", "oven", "toaster", "grass", "snow", "monitor", "small", "mouse pad", "on top of", "device", "racket", "sofa", "bookcase", "sink", "white", "bathtub", "boy", "bag", "black", "backpack", "cloth", "remote control", "plastic", "charger", "computer mouse", "camera", "cell phone", "woman", "shirt", "short sleeved", "cotton", "bed", "table", "above", "lamp", "picture", "to the right of", "curtain", "soft", "chair", "bookshelf", "skateboard", "toilet", "elephant", "child", "banana", "container", "restaurant", "in", "wood", "pizza box", "under", "glove", "snowboard", "plate", "girl", "happy", "sand", "food", "bear", "bird", "green", "sheet", "pillowcase", "blond", "helmet", "planter", "window", "door", "sweater", "jacket", "performing trick", "male", "talking", "waiting", "dark", "tree", "in front of", "bench", "full", "behind", "closet", "stuffed bear", "coffee table", "smiling", "frame", "below", "uniform", "blue", "hat", "caucasian", "young", "skinny", "looking up", "thin", "car", "old", "tie", "mug", "cup", "donut", "biscuit", "television", "short", "appliance", "clean", "microwave", "on", "empty", "mud", "stainless steel", "pan", "beside", "saucer", "horse", "lamb", "light brown", "shelf", "fence", "near", "mirror", "standing", "bus", "cd", "tall", "tape", "umpire", "keyboard", "painting", "can", "notebook", "ball", "player", "stove", "open", "airplane", "truck", "batter", "catcher", "dishwasher", "face mask", "metal", "off", "dog", "kitten", "towel", "fire hydrant", "motorcycle", "utensil", "hard", "fork", "knife", "silver", "cabinet", "desk", "book", "sheep", "gorilla", "walking", "goat", "laptop", "bat", "long", "nightstand", "counter", "square", "coffee maker", "tank top", "nike", "striped", "sweatshirt", "cake", "berry", "staring", "umbrella", "stroller", "stuffed dog", "kite", "computer", "skateboarder", "number", "new", "floor", "countertop", "underneath", "beach umbrella", "microwave oven", "boat", "rope", "dress shirt", "bread", "narrow", "skate park", "purse", "orange", "peach", "still", "reading", "spice", "bowl", "dirty", "salt shaker", "wide", "lying", "adult", "sad", "closed", "cupboard", "drawer", "crouching", "gray", "large", "refrigerator", "brown", "vase", "shorts", "spoon", "mashed potato", "sign", "bouquet", "eggplant", "purple", "cabbage", "fireplace", "calm", "pants", "jeans", "clock", "yellow", "covered", "guitar", "cow", "poster", "asian", "hair clip", "toothbrush", "faucet", "water bottle", "looking down", "comfortable", "coffee mug", "round", "ladder", "scarf", "lady", "tennis ball", "antique", "basket", "apple", "wallet", "train", "platform", "next to", "bathroom", "shower", "fire truck", "traffic light", "pot", "baseball", "pink", "doll", "blind", "wine glass", "wine bottle", "wii controller", "dress", "skirt", "side table", "spatula", "street sign", "urinal", "porcelain", "speaker", "baseball bat", "penguin", "pastry", "cat", "paper", "parent", "female", "giraffe", "vest", "headphone", "cowboy hat", "strawberry", "pizza", "menu", "flower", "box", "soap dispenser", "glass", "electric", "cyclist", "blueberry", "fat", "heavy", "artwork", "tea kettle", "outdoors", "screen", "drink", "leather", "frisbee", "pecan", "serving tray", "napkin", "carrot", "wetsuit", "surfboard", "long sleeved", "coach", "sailboat", "tablecloth", "policeman", "carpet", "chimney", "soccer ball", "flag", "packet", "jersey", "cap", "traffic sign", "phone", "eating", "playing", "step", "folding chair", "t-shirt", "soccer player", "running", "thick", "waffle", "fresh", "cookie", "vegetable", "bean", "water", "bridge", "post", "vehicle", "computer monitor", "resting", "pretty", "chopstick", "sandwich", "mango", "parking meter", "zebra", "mattress", "suv", "parrot", "dresser", "van", "knee pad", "elbow pad", "modern", "grape", "trash can", "skier", "tractor", "tomato", "kettle", "safety jacket", "statue", "calculator", "pizza slouse", "blouse", "posing", "chicken", "cash register", "cupcake", "old fashioned", "suitcase", "bottle", "candle", "bell", "gift", "skater", "calf", "field", "spectator", "baseball player", "leafy", "cauliflower", "boot", "blanket", "hamburger", "dugout", "palm tree", "wall", "alarm clock", "ice maker", "toilet paper", "telephone pole", "skiing", "mother", "mat", "dish drainer", "tray", "gentleman", "router", "dark brown", "deer", "dolphin", "pepper", "puppy", "washing machine", "soup", "meat", "mannequin", "sock", "word", "high", "tan", "wine", "scooter", "driving", "tissue box", "pepper shaker", "picture frame", "soap", "attached", "colorful", "steel", "ambulance", "shuttle", "rug", "pale", "sleeping", "rough", "surfer", "goal", "broom", "potato", "necklace", "bracelet", "shield", "fruit", "cheese", "lettuce", "fry", "shiny", "bending", "computer desk", "guy", "building", "jet", "teddy bear", "uncomfortable", "tissue", "khaki", "crate", "bucket", "cherry", "rice", "salad", "pilot", "tent", "brownie", "light", "doorway", "light fixture", "house", "bar stool", "tv stand", "bald", "sandal", "cooked", "olive", "unoccupied", "photographer", "magazine", "stop sign", "she", "chocolate", "baby", "ice", "moose", "radio", "electronic", "snowboarder", "blender", "athletic", "bun", "gold", "paper dispenser", "gun", "bull", "antelope", "whipped cream", "athlete", "suit", "inside", "ice cube", "entertainment center", "dvd player", "object", "taxi", "coffee pot", "life jacket", "brunette", "light bulb", "parked", "camel", "kitchen", "bedspread", "cart", "nut", "bath towel", "denim", "shower curtain", "broccoli", "vendor", "football", "crown", "outlet", "american flag", "home plate", "dark blue", "street", "sticker", "officer", "leggings", "dinosaur", "flat", "pen", "dumpster", "monkey", "dragonfly", "coffee", "beige", "sprinkle", "student", "black and white", "cane", "onion ring", "made", "hippo", "briefcase", "almond", "toilet brush", "tool", "ottoman", "balloon", "comforter", "flamingo", "printer", "console", "bagel", "trash bag", "pipe", "light blue", "dry-erase board", "figurine", "train track", "smooth", "toy", "boar", "shoe", "tenni", "false", "abundant", "having meeting", "lying on top of", "furniture", "ripe", "peeled", "unripe", "top", "bottom", "wet", "right", "left", "sitting atop", "luggage", "sitting in front of", "sleeveless", "radiator", "opaque", "concrete", "adida", "wavy", "choppy", "surfing", "dry", "riding", "triangular", "scissors", "wooden", "spray bottle", "hair", "sky", "cloudy", "this", "rotten", "he", "touching", "parked behind", "sitting on top of", "jar", "scene", "sunny", "crane", "coffee cup", "living room", "jumping", "bare", "paved", "sidewalk", "unpaved", "stone", "little", "tail", "bushy", "holding", "snow pants", "clear", "raw", "snack", "dining table", "chrome", "pear", "dip", "pitcher", "around", "huge", "drinking", "sneaker", "cobblestone", "forest", "ground", "leaf", "cylindrical", "swimming", "sitting at", "driver", "dessert", "bush", "wheel", "decorated with", "pointing", "cushioned", "city", "village", "lush", "leafless", "trailer", "road", "plant", "rainbow colored", "of", "indoors", "office", "store", "looking at", "beach", "sandy", "soccer", "rocky", "river", "preparing", "watch", "fast food", "path", "ugly", "teal", "beautiful", "bamboo", "wool", "foggy", "newspaper", "window frame", "handbag", "burner", "cooking utensil", "cutting board", "park", "metallic", "mountain", "mustard bottle", "spinach", "melted", "net", "dirt", "label", "maroon", "wicker", "snowy", "snowboarding", "shopping center", "cloud", "tiny", "asphalt", "brick", "lid", "sauce", "cream colored", "clothing", "bright", "tinted", "sitting inside", "lake", "paper towel", "checkered", "dense", "dotted", "healthy", "sitting on", "holding onto", "watching", "ceiling", "pencil", "marker", "cardboard", "bedroom", "gown", "tree leaf", "yard", "alcohol", "grassy", "ocean", "helicopter", "farm", "logo", "ostrich", "arrow", "office chair", "hay", "wrapped around", "parking lot", "mesh", "sparse", "rose", "controller", "crowd", "onion", "unhealthy", "serving dish", "granite", "sour cream", "cable", "hill", "puffy", "aluminum", "oven door", "heel", "leaning on", "down", "overcast", "heater", "donkey", "angry", "ice cream", "vanilla", "flower pot", "skateboarding", "graffiti", "skating", "low", "bus driver", "grill", "tire", "resting on", "tea pot", "rubber", "squash", "clothe", "horizontal", "sausage", "standing on top of", "toothpaste", "plugged into", "railroad", "tunnel", "paddle", "hot dog", "cloudless", "paper container", "ring", "wristband", "decorated", "pedestrian", "apartment building", "dining room", "stormy", "sitting beside", "unlit", "performer", "reflective", "unpeeled", "working on", "marshmallow", "sign post", "partly cloudy", "iron", "fan", "connected to", "bottle cap", "pole", "vintage", "hardwood", "ceramic", "clay", "tile", "pasture", "sitting in", "staircase", "greasy", "fried", "using", "straw", "beneath", "playing at", "walking near", "standing beside", "pine tree", "soap bottle", "copper", "baseball mitt", "chandelier", "regular", "irregular", "apron", "cord", "hotel", "power line", 