{"op_to_idx": {"select": 1, "choose_attr": 2, "relate": 3, "filter": 4, "and": 5, "exist": 6, "or": 7, "all_different": 8, "verify_attrs": 9, "two_different": 10, "query_attr": 11, "choose_rel": 12, "verify_rel": 13, "compare": 14, "all_same": 15, "two_same": 16}, "idx_to_op": ["select", "choose_attr", "relate", "filter", "and", "exist", "or", "all_different", "verify_attrs", "two_different", "query_attr", "choose_rel", "verify_rel", "compare", "all_same", "two_same"], "arg_to_idx": {"brown": 1, "ground": 2, "blue": 3, "large": 4, "wall": 5, "near": 6, "true": 7, "refrigerator": 8, "small": 9, "aluminum": 10, "fence": 11, "concrete": 12, "white": 13, "car": 14, "orange": 15, "off": 16, "helicopter": 17, "on": 18, "cabinet": 19, "this": 20, "bed": 21, "dense": 22, "sparse": 23, "narrow": 24, "river": 25, "wide": 26, "glass": 27, "glasses": 28, "round": 29, "wire": 30, "cloth": 31, "pants": 32, "leather": 33, "black and white": 34, "pen": 35, "colorful": 36, "blond": 37, "performer": 38, "to the left of": 39, "man": 40, "brunette": 41, "lush": 42, "field": 43, "tree": 44, "bare": 45, "jacket": 46, "cotton": 47, "male": 48, "ball": 49, "soccer player": 50, "female": 51, "teal": 52, "dress shirt": 53, "gray": 54, "sofa": 55, "furniture": 56, "right": 57, "container": 58, "plastic": 59, "left": 60, "black": 61, "towel": 62, "long sleeved": 63, "shirt": 64, "sleeveless": 65, "window": 66, "paper": 67, "napkin": 68, "bottle": 69, "cup": 70, "hair": 71, "red": 72, "top": 73, "umbrella": 74, "bottom": 75, "tan": 76, "bag": 77, "purple": 78, "unpeeled": 79, "in front of": 80, "fruit": 81, "peeled": 82, "porcelain": 83, "short sleeved": 84, "shoe": 85, "pink": 86, "metal": 87, "clock": 88, "chandelier": 89, "frisbee": 90, "yellow": 91, "helmet": 92, "soccer ball": 93, "traffic light": 94, "player": 95, "next to": 96, "rough": 97, "sand": 98, "wet": 99, "smooth": 100, "long": 101, "short": 102, "closed": 103, "door": 104, "open": 105, "new": 106, "train": 107, "old": 108, "grass": 109, "tall": 110, "painting": 111, "sweatshirt": 112, "young": 113, "pedestrian": 114, "park": 115, "scene": 116, "beach": 117, "square": 118, "table": 119, "wood": 120, "marshmallow": 121, "athlete": 122, "cake": 123, "waiting": 124, "catcher": 125, "playing": 126, "goat": 127, "sheep": 128, "silver": 129, "oven": 130, "above": 131, "microwave": 132, "paper towel": 133, "bird": 134, "resting": 135, "skating": 136, "person": 137, "looking up": 138, "riding": 139, "tv stand": 140, "inside": 141, "dvd": 142, "girl": 143, "sock": 144, "clothing": 145, "dark": 146, "blouse": 147, "navy": 148, "hat": 149, "sign": 150, "airplane": 151, "cutting board": 152, "appliance": 153, "shelf": 154, "coffee table": 155, "water bottle": 156, "dessert": 157, "mat": 158, "farm": 159, "bus": 160, "to the right of": 161, "cat": 162, "road": 163, "chair": 164, "green": 165, "light brown": 166, "pillow": 167, "eggplant": 168, "box": 169, "vehicle": 170, "sausage": 171, "cooked": 172, "woman": 173, "flower": 174, "cow": 175, "caucasian": 176, "stainless steel": 177, "tennis ball": 178, "brick": 179, "looking down": 180, "standing": 181, "walking": 182, "flower pot": 183, "racket": 184, "surfboard": 185, "knife": 186, "skateboarding": 187, "skateboarder": 188, "phone": 189, "device": 190, "framed": 191, "monitor": 192, "outdoors": 193, "indoors": 194, "trash can": 195, "sink": 196, "giraffe": 197, "staring at": 198, "false": 199, "animal": 200, "rhino": 201, "dark blue": 202, "safety jacket": 203, "toilet": 204, "sitting": 205, "happy": 206, "running": 207, "dirty": 208, "dirt": 209, "dark brown": 210, "clean": 211, "full": 212, "drink": 213, "empty": 214, "keyboard": 215, "horse": 216, "building": 217, "behind": 218, "dry": 219, "pasture": 220, "metallic": 221, "lamp": 222, "purse": 223, "mug": 224, "bedroom": 225, "bathroom": 226, "uncomfortable": 227, "comfortable": 228, "ugly": 229, "sky": 230, "cloudy": 231, "beautiful": 232, "life jacket": 233, "desk": 234, "sturdy": 235, "couch": 236, "clear": 237, "raw": 238, "vegetable": 239, "picture": 240, "hanging above": 241, "blanket": 242, "forest": 243, "snowy": 244, "mouse pad": 245, "food": 246, "thin": 247, "monkey": 248, "artwork": 249, "under": 250, "skateboard": 251, "on top of": 252, "television": 253, "skinny": 254, "fat": 255, "spatula": 256, "cooking utensil": 257, "warm": 258, "pan": 259, "bush": 260, "gold": 261, "necklace": 262, "can": 263, "remote control": 264, "holding": 265, "house": 266, "berry": 267, "dresser": 268, "wristband": 269, "bookcase": 270, "reading": 271, "sleeping": 272, "speaker": 273, "boat": 274, "sidewalk": 275, "posing": 276, "bending": 277, "telephone pole": 278, "toaster": 279, "sitting beside": 280, "coffee maker": 281, "table lamp": 282, "gentleman": 283, "baseball mitt": 284, "mirror": 285, "fire truck": 286, "bridge": 287, "ambulance": 288, "rug": 289, "coat": 290, "sandwich": 291, "tea": 292, "thick": 293, "book": 294, "light blue": 295, "stone": 296, "floor": 297, "hardwood": 298, "asphalt": 299, "cobblestone": 300, "cupcake": 301, "rainbow colored": 302, "carrot": 303, "leafless": 304, "bucket": 305, "flag": 306, "talking": 307, "electronic": 308, "rope": 309, "tire": 310, "below": 311, "folding chair": 312, "oil": 313, "snowboarder": 314, "shorts": 315, "truck": 316, "tractor": 317, "umpire": 318, "fried": 319, "faucet": 320, "chrome": 321, "notebook": 322, "asian": 323, "utensil": 324, "elephant": 325, "jersey": 326, "baseball": 327, "vase": 328, "sitting in": 329, "she": 330, "crown": 331, "tank top": 332, "fork": 333, "palm tree": 334, "boy": 335, "adidas": 336, "bowl": 337, "rocky": 338, "mountain": 339, "grassy": 340, "wooden": 341, "sweater": 342, "laptop": 343, "little": 344, "mother": 345, "office chair": 346, "grape": 347, "cut": 348, "stove": 349, "stadium": 350, "huge": 351, "parked": 352, "broccoli": 353, "lettuce": 354, "pot": 355, "curtain": 356, "flat": 357, "van": 358, "plate": 359, "beige": 360, "frame": 361, "driving": 362, "cake stand": 363, "bear": 364, "calculator": 365, "drape": 366, "shopping center": 367, "dog": 368, "coffee cup": 369, "tape": 370, "pig": 371, "poster": 372, "chicken": 373, "greasy": 374, "pizza": 375, "stained": 376, "cord": 377, "suv": 378, "sliced": 379, "apple": 380, "bench": 381, "iron": 382, "unlit": 383, "leafy": 384, "staring": 385, "drinking": 386, "hot dog": 387, "rectangular": 388, "polo shirt": 389, "basket": 390, "banana": 391, "kitten": 392, "playing with": 393, "luggage": 394, "pole": 395, "traffic sign": 396, "adida": 397, "bat": 398, "nike": 399, "bean": 400, "cylindrical": 401, "motorcycle": 402, "rubber": 403, "entertainment center": 404, "sheet": 405, "wii controller": 406, "using": 407, "jet": 408, "heel": 409, "bottle cap": 410, "low": 411, "high": 412, "blind": 413, "zebra": 414, "soft": 415, "controller": 416, "cell phone": 417, "cabbage": 418, "scissors": 419, "toilet seat": 420, "spoon": 421, "cream colored": 422, "counter": 423, "cloud": 424, "ripe": 425, "camera": 426, "fire hydrant": 427, "jumping": 428, "overcast": 429, "rainy": 430, "sitting on": 431, "sandy": 432, "utensil holder": 433, "marker": 434, "cauliflower": 435, "dress": 436, "old fashioned": 437, "modern": 438, "suit": 439, "heater": 440, "balloon": 441, "pear": 442, "striped": 443, "store": 444, "antique": 445, "drawer": 446, "bright": 447, "logo": 448, "countertop": 449, "underneath": 450, "cooking": 451, "straight": 452, "curly": 453, "trash": 454, "tie": 455, "lying on top of": 456, "tray": 457, "light": 458, "kite": 459, "toothbrush": 460, "toilet paper": 461, "resting on": 462, "tenni": 463, "jeans": 464, "denim": 465, "suitcase": 466, "stuffed bear": 467, "toy": 468, "doll": 469, "cap": 470, "dull": 471, "smiling": 472, "fine": 473, "deer": 474, "granite": 475, "snack": 476, "digital": 477, "storage box": 478, "glove": 479, "soap dispenser": 480, "computer mouse": 481, "ski": 482, "restaurant": 483, "market": 484, "having meeting": 485, "skier": 486, "olive": 487, "larger than": 488, "wine": 489, "beer": 490, "powder": 491, "batter": 492, "lying": 493, "t-shirt": 494, "lady": 495, "sad": 496, "candle": 497, "leaning on": 498, "mixer": 499, "cheese": 500, "fast food": 501, "hamburger": 502, "rice": 503, "pasta": 504, "label": 505, "beside": 506, "lawn": 507, "toilet lid": 508, "printer": 509, "bread": 510, "closet": 511, "in": 512, "toothpaste": 513, "train station": 514, "shower": 515, "shut": 516, "pavement": 517, "radio": 518, "computer": 519, "sitting in front of": 520, "bushy": 521, "cream": 522, "pepperoni": 523, "wildflower": 524, "brownie": 525, "grouped": 526, "waffle": 527, "unhappy": 528, "bookshelf": 529, "tissue box": 530, "puppy": 531, "pipe": 532, "snow": 533, "tent": 534, "folded": 535, "sign post": 536, "watch": 537, "runway": 538, "steel": 539, "crosswalk": 540, "bike": 541, "dock": 542, "unhealthy": 543, "healthy": 544, "side table": 545, "cupboard": 546, "wine bottle": 547, "yes": 548, "nightstand": 549, "no": 550, "duck": 551, "letter": 552, "number": 553, "star": 554, "antelope": 555, "lamb": 556, "cage": 557, "mud": 558, "kitchen": 559, "dragon": 560, "kiwi": 561, "peach": 562, "statue": 563, "taxi": 564, "sandal": 565, "parrot": 566, "cone": 567, "bun": 568, "meat": 569, "onion": 570, "pepper": 571, "object": 572, "backpack": 573, "shield": 574, "paddle": 575, "ladder": 576, "boar": 577, "desk lamp": 578, "sweet potato": 579, "by": 580, "child": 581, "donut": 582, "dip": 583, "seagull": 584, "coach": 585, "tomato": 586, "scarf": 587, "tablecloth": 588, "snowboard": 589, "goggles": 590, "teddy bear": 591, "owl": 592, "pigeon": 593, "screen": 594, "knee pad": 595, "fake": 596, "saucer": 597, "shrimp": 598, "mushroom": 599, "hose": 600, "boot": 601, "rubber duck": 602, "walnut": 603, "dinosaur": 604, "leopard": 605, "lion": 606, "collar": 607, "baseball bat": 608, "chimney": 609, "floor lamp": 610, "potato": 611, "dishwasher": 612, "magazine": 613, "bagel": 614, "with": 615, "bracelet": 616, "surfer": 617, "wetsuit": 618, "parachute": 619, "lemon": 620, "ice": 621, "parking meter": 622, "clothe": 623, "jar": 624, "gift": 625, "router": 626, "peanut": 627, "moss": 628, "trailer": 629, "bicycle": 630, "game controller": 631, "cart": 632, "worker": 633, "egg": 634, "stop sign": 635, "guitar": 636, "drum": 637, "dvd player": 638, "briefcase": 639, "spectator": 640, "microwave oven": 641, "passenger": 642, "spray can": 643, "sailboat": 644, "blender": 645, "hair clip": 646, "train car": 647, "maroon": 648, "appetizer": 649, "strawberry": 650, "dining table": 651, "hippo": 652, "pancake": 653, "bunny": 654, "frog": 655, "heart": 656, "skiing": 657, "mattress": 658, "steam": 659, "smoke": 660, "leggings": 661, "tablet": 662, "computer monitor": 663, "soap": 664, "packet": 665, "bell": 666, "dish drainer": 667, "american flag": 668, "mustard": 669, "sculpture": 670, "milk": 671, "coffee": 672, "swan": 673, "ottoman": 674, "pliers": 675, "flamingo": 676, "microphone": 677, "dispenser": 678, "coffee pot": 679, "mango": 680, "baby": 681, "armchair": 682, "word": 683, "canister": 684, "parent": 685, "water": 686, "lipstick": 687, "cd": 688, "pencil": 689, "soap dish": 690, "camel": 691, "cracker": 692, "wine glass": 693, "fry": 694, "street sign": 695, "light bulb": 696, "lock": 697, "butter knife": 698, "cyclist": 699, "of": 700, "salt shaker": 701, "garland": 702, "cheetah": 703, "cheesecake": 704, "soup": 705, "scooter": 706, "ostrich": 707, "carriage": 708, "photographer": 709, "stroller": 710, "bandage": 711, "football": 712, "toddler": 713, "bee": 714, "toaster oven": 715, "diaper": 716, "rabbit": 717, "uniform": 718, "comforter": 719, "pillowcase": 720, "pepper shaker": 721, "swimmer": 722, "sprinkle": 723, "eating": 724, "fresh": 725, "polar bear": 726, "butterfly": 727, "kettle": 728, "cigarette": 729, "waste basket": 730, "cheese cube": 731, "piano": 732, "candy": 733, "blazer": 734, "bread box": 735, "figurine": 736, "end table": 737, "ipod": 738, "branch": 739, "apron": 740, "donkey": 741, "checkered": 742, "cucumber": 743, "eagle": 744, "lizard": 745, "bird cage": 746, "street": 747, "headband": 748, "buoy": 749, "post": 750, "notepad": 751, "biker": 752, "adult": 753, "pastry": 754, "salad": 755, "vest": 756, "serving tray": 757, "tiger": 758, "tangerine": 759, "bathtub": 760, "skyscraper": 761, "wolf": 762, "cookie": 763, "tea kettle": 764, "moose": 765, "father": 766, "broom": 767, "snake": 768, "tissue": 769, "tool": 770, "peacock": 771, "lighthouse": 772, "shuttle": 773, "snowboarding": 774, "dragonfly": 775, "snowsuit": 776, "cake slouse": 777, "guy": 778, "tower": 779, "castle": 780, "parking sign": 781, "outfit": 782, "sugar packet": 783, "shopping cart": 784, "pizza slice": 785, "hotel room": 786, "plush": 787, "tofu": 788, "battery": 789, "hook": 790, "cooker": 791, "skirt": 792, "picnic table": 793, "wheelchair": 794, "almond": 795, "muffin": 796, "dumpster": 797, "ketchup": 798, "bouquet": 799, "student": 800, "soldier": 801, "clock tower": 802, "bar stool": 803, "curved": 804, "melon": 805, "juice": 806, "net": 807, "coconut": 808, "jumpsuit": 809, "chess piece": 810, "whale": 811, "bedspread": 812, "swimsuit": 813, "penguin": 814, "mannequin": 815, "beet": 816, "squash": 817, "radiator": 818, "dolphin": 819, "chef": 820, "toolbox": 821, "console": 822, "decorative": 823, "seal": 824, "charger": 825, "sneaker": 826, "cable": 827, "plant": 828, "sack": 829, "wallet": 830, "lobster": 831, "goose": 832, "vending machine": 833, "planter": 834, "spider": 835, "step": 836, "unripe": 837, "cane": 838, "office": 839, "ice cream": 840, "calf": 841, "sponge": 842, "earring": 843, "heavy": 844, "shark": 845, "athletic shoe": 846, "dream catcher": 847, "panda bear": 848, "stuffed animal": 849, "entree": 850, "minivan": 851, "rock": 852, "paint brush": 853, "ice-cream cone": 854, "kangaroo": 855, "nut": 856, "pretzel": 857, "bronze": 858, "toilet brush": 859, "gun": 860, "sword": 861, "shopping bag": 862, "terminal": 863, "at": 864, "food truck": 865, "coffee mug": 866, "pizza slouse": 867, "ice cube": 868, "cookbook": 869, "raisin": 870, "cherry": 871, "vendor": 872, "graffiti": 873, "comb": 874, "walkway": 875, "wig": 876, "biscuit": 877, "ham": 878, "angry bird": 879, "blueberry": 880, "ramekin": 881, "customer": 882, "crouching": 883, "potted": 884, "onion ring": 885, "ladle": 886, "towel dispenser": 887, "burrito": 888, "crab": 889, "crate": 890, "bull": 891, "mailbox": 892, "trash bag": 893, "gummy bear": 894, "computer desk": 895, "gorilla": 896, "handbag": 897, "chalkboard": 898, "wius": 899, "alarm clock": 900, "bird house": 901, "croissant": 902, "bison": 903, "real": 904, "watermelon": 905, "marble": 906, "headphone": 907, "cereal": 908, "shiny": 909, "gas stove": 910, "vintage": 911, "stir fry": 912, "cardboard": 913, "fire extinguisher": 914, "policeman": 915, "hair dryer": 916, "surfing": 917, "pecan": 918, "trumpet": 919, "papaya": 920, "bacon": 921, "toast": 922, "skillet": 923, "tourist": 924, "chopstick": 925, "rolling pin": 926, "stew": 927, "elbow pad": 928, "beach umbrella": 929, "mozzarella": 930, "log": 931, "visitor": 932, "pineapple": 933, "locomotive": 934, "railroad": 935, "dining room": 936, "paper dispenser": 937, "celery": 938, "alligator": 939, "chef hat": 940, "wardrobe": 941, "knife block": 942, "couple": 943, "deck": 944, "he": 945, "turtle": 946, "hammer": 947, "hairbrush": 948, "pea": 949, "barn": 950, "grinder": 951, "burger": 952, "skater": 953, "squirrel": 954, "rotten": 955, "binder": 956, "tortilla": 957, "pizza pan": 958, "pouch": 959, "wagon": 960, "coin": 961, "wireless": 962, "up": 963, "toasted": 964, "daughter": 965, "dish": 966, "fan": 967, "clay": 968, "envelope": 969, "lime": 970, "officer": 971, "pizza cutter": 972, "raspberry": 973, "napkin dispenser": 974, "panda": 975, "waitress": 976, "dry-erase board": 977, "home plate": 978, "pajama": 979, "wing": 980, "belt": 981, "asparagus": 982, "hand towel": 983, "daisy": 984, "dish soap": 985, "fluffy": 986, "placemat": 987, "armor": 988, "plier": 989, "cowboy hat": 990, "hard drive": 991, "swimming": 992, "beach chair": 993, "fireplace": 994, "crystal": 995, "wicker": 996, "lid": 997, "triangular": 998, "dryer": 999, "urinal": 1000, "bandana": 1001, "desktop computer": 1002, "on the side of": 1003, "zoo": 1004, "pomegranate": 1005, "snail": 1006, "cream cheese": 1007, "robe": 1008, "tongs": 1009, "seed": 1010, "avocado": 1011, "rice cooker": 1012, "basil": 1013, "beer mug": 1014, "dried": 1015, "street light": 1016, "shallow": 1017, "poodle": 1018, "scrub brush": 1019, "pizza tray": 1020, "ice maker": 1021, "driver": 1022, "puddle": 1023, "gate": 1024, "brush": 1025, "around": 1026, "living room": 1027, "soda": 1028, "beer bottle": 1029, "flip flop": 1030, "irregular": 1031, "cooking pot": 1032, "ship": 1033, "hand soap": 1034, "grazing": 1035, "apartment building": 1036, "school bus": 1037, "shampoo": 1038, "cowboy": 1039, "electric toothbrush": 1040, "shower curtain": 1041, "corn": 1042, "bomb": 1043, "canoe": 1044, "herd": 1045, "flatbread": 1046, "pistachio": 1047, "cigar": 1048, "soda bottle": 1049, "jeep": 1050, "pitcher": 1051, "lit": 1052, "alien": 1053, "son": 1054, "vacuum": 1055, "platform": 1056, "cash register": 1057, "yogurt": 1058, "khaki": 1059, "bath towel": 1060, "gadget": 1061, "employee": 1062, "shopper": 1063, "parking lot": 1064, "whisk": 1065, "meal": 1066, "grilled": 1067, "fisherman": 1068, "bell tower": 1069, "filled": 1070, "nest": 1071, "fruit stand": 1072, "covered": 1073, "pita": 1074, "hedge": 1075, "medicine cabinet": 1076, "loaf": 1077, "steak": 1078, "sticky note": 1079, "tea pot": 1080, "crowd": 1081, "ocean": 1082, "pilot": 1083, "cranberry": 1084, "video camera": 1085, "coleslaw": 1086, "french toast": 1087, "stair": 1088, "baking sheet": 1089, "cereal box": 1090, "air": 1091, "xbox controller": 1092, "tomato sauce": 1093, "uncooked": 1094, "carpet": 1095, "gravel": 1096, "hotdog bun": 1097, "beneath": 1098, "train track": 1099, "taco": 1100, "baked": 1101, "crumb": 1102, "garlic": 1103, "path": 1104, "spinach": 1105, "pizza box": 1106, "wild": 1107, "costume": 1108, "butter": 1109, "parsley": 1110, "boiled": 1111, "projector": 1112, "overhead": 1113, "herb": 1114, "sour cream": 1115, "station": 1116, "dish towel": 1117, "farmer": 1118, "zucchini": 1119, "doorway": 1120, "toy car": 1121, "picture frame": 1122, "cabin": 1123, "bedding": 1124, "mexican food": 1125, "display": 1126, "wine glasses": 1127, "salmon": 1128, "beverage": 1129, "jockey": 1130, "whipped cream": 1131, "roll": 1132, "trunk": 1133, "rounded": 1134, "pine tree": 1135, "bartender": 1136, "pie": 1137, "mask": 1138, "rose": 1139, "hard": 1140, "ketchup bottle": 1141, "sauce": 1142, "copper": 1143, "lunch box": 1144, "beef": 1145, "bikini": 1146, "machine": 1147, "noodle": 1148, "crispy": 1149, "spear": 1150, "leaf": 1151, "grater": 1152, "parmesan cheese": 1153, "dotted": 1154, "artichoke": 1155, "grapefruit": 1156, "porch": 1157, "blossom": 1158, "garden": 1159, "on the edge of": 1160, "pond": 1161, "cooler": 1162, "elderly": 1163, "cluttered": 1164, "stapler": 1165, "egg roll": 1166, "engineer": 1167, "down": 1168, "bald": 1169, "straw": 1170, "air conditioner": 1171, "fence post": 1172, "barrier": 1173, "brass": 1174, "can opener": 1175, "ceramic": 1176, "pumpkin": 1177, "transparent": 1178, "soap bottle": 1179, "casserole": 1180, "crooked": 1181, "flmy": 1182, "serving dish": 1183, "bus driver": 1184, "they": 1185, "steamed": 1186, "deep": 1187, "food processor": 1188, "stuffed dog": 1189, "chocolate": 1190, "liquor": 1191, "wool": 1192, "lace": 1193, "on the back of": 1194, "honey": 1195, "cinnamon roll": 1196, "hanging": 1197, "styrofoam": 1198, "syrup": 1199, "gown": 1200, "silverware": 1201, "kitchen towel": 1202, "water glass": 1203, "gourd": 1204, "ravioli": 1205, "shampoo bottle": 1206, "dumpling": 1207, "baking pan": 1208, "waiter": 1209, "bleacher": 1210, "head": 1211, "chocolate chip": 1212, "patio": 1213, "cheeseburger": 1214, "power line": 1215, "on the front of": 1216, "mall": 1217, "milkshake": 1218, "newspaper": 1219, "temple": 1220, "produce": 1221, "hill": 1222, "tiny": 1223, "apple logo": 1224, "balcony": 1225, "bread loaf": 1226, "face mask": 1227, "elmo": 1228, "eye glasses": 1229, "wristwatch": 1230, "pickle": 1231, "peanut butter": 1232, "mound": 1233, "broth": 1234, "apartment": 1235, "curled": 1236, "horizontal": 1237, "barefoot": 1238, "plantain": 1239, "cross": 1240, "platter": 1241, "feta cheese": 1242, "burner": 1243, "pizza pie": 1244, "washing machine": 1245, "lemonade": 1246, "spray bottle": 1247, "fuzzy": 1248, "regular": 1249, "undershirt": 1250, "crust": 1251, "tag": 1252, "yard": 1253, "shop": 1254, "coke": 1255, "between": 1256, "lamp shade": 1257, "baker": 1258, "macaroni": 1259, "oak tree": 1260, "raincoat": 1261, "village": 1262, "seat": 1263, "pocket": 1264, "pizza oven": 1265, "spice": 1266, "kneeling": 1267, "stage": 1268, "shredded": 1269, "omelette": 1270, "ear bud": 1271, "swimming pool": 1272, "beer can": 1273, "double decker": 1274, "upholstered": 1275, "opaque": 1276, "turkey": 1277, "laughing": 1278, "blackberry": 1279, "restroom": 1280, "mixing bowl": 1281, "card": 1282, "snow pants": 1283, "calm": 1284, "roast beef": 1285, "curiou": 1286, "tuna": 1287, "action figure": 1288, "hairy": 1289, "angry": 1290, "home": 1291, "roadway": 1292, "plaid": 1293, "ceiling": 1294, "mesh": 1295, "cake pan": 1296, "dugout": 1297, "dinner": 1298, "earphone": 1299, "menu": 1300, "candle holder": 1301, "pasta salad": 1302, "mashed potato": 1303, "shore": 1304, "guacamole": 1305, "giant": 1306, "package": 1307, "decoration": 1308, "lake": 1309, "tinted": 1310, "deliciou": 1311, "outlet": 1312, "hillside": 1313, "pointing": 1314, "vitamin": 1315, "window frame": 1316, "instrument": 1317, "chickpea": 1318, "chinese food": 1319, "octopu": 1320, "sunflower": 1321, "electric": 1322, "chili": 1323, "lego": 1324, "weed": 1325, "hay": 1326, "kiosk": 1327, "wavy": 1328, "elevated": 1329, "padded": 1330, "pudding": 1331, "fish": 1332, "cotton dessert": 1333, "soda can": 1334, "intersection": 1335, "cookie jar": 1336, "orchid": 1337, "liquid": 1338, "hand dryer": 1339, "balding": 1340, "oblong": 1341, "wedding": 1342, "backyard": 1343, "chicken breast": 1344, "room": 1345, "hallway": 1346, "receipt": 1347, "diced": 1348, "rifle": 1349, "shirtless": 1350, "juice box": 1351, "vertical": 1352, "patterned": 1353, "on the other side of": 1354, "sheer": 1355, "rolled": 1356, "shaped": 1357, "stacked": 1358, "harbor": 1359, "mane": 1360, "frosting": 1361, "floating": 1362, "stormy": 1363, "fur": 1364, "moving": 1365, "tile": 1366, "cloudless": 1367, "mustard bottle": 1368, "assorted": 1369, "island": 1370, "filled with": 1371, "map": 1372, "partly cloudy": 1373, "sunny": 1374, "soccer": 1375, "painted": 1376, "choppy": 1377, "sitting at": 1378, "library": 1379, "sticker": 1380, "tunnel": 1381, "paved": 1382, "cutting": 1383, "made": 1384, "headboard": 1385, "arrow": 1386, "garage": 1387, "contain": 1388, "sitting on top of": 1389, "carrying": 1390, "tail": 1391, "game": 1392, "foggy": 1393, "glowing": 1394, "desert": 1395, "license plate": 1396, "full of": 1397, "still": 1398, "neat": 1399, "standing behind": 1400, "fudge": 1401, "leaning over": 1402, "eye": 1403, "beard": 1404, "garage door": 1405, "covering": 1406, "stuffed": 1407, "walking behind": 1408, "silk": 1409, "climbing": 1410, "flame": 1411, "flying": 1412, "burnt": 1413, "canopy": 1414, "museum": 1415, "airport": 1416, "lip": 1417, "feather": 1418, "elevator": 1419, "typing on": 1420, "public": 1421, "sail": 1422, "playing on": 1423, "military": 1424, "tasty": 1425, "wheel": 1426, "nose": 1427, "unpaved": 1428, "mixed": 1429, "exiting": 1430, "propeller": 1431, "bus stop": 1432, "standing on": 1433, "baseball player": 1434, "roof": 1435, "chain": 1436, "baked good": 1437, "miniature": 1438, "hanging over": 1439, "murky": 1440, "preparing": 1441, "puffy": 1442, "city": 1443, "looking at": 1444, "audience": 1445, "speckled": 1446, "aircraft": 1447, "sun": 1448, "immature": 1449, "mature": 1450, "lying on": 1451, "drawing": 1452, "ginger": 1453, "garment": 1454, "tied": 1455, "waiting for": 1456, "wearing": 1457, "roasted": 1458, "piled": 1459, "petting": 1460, "printed": 1461, "calico": 1462, "dark colored": 1463, "octagonal": 1464, "grill": 1465, "topped with": 1466, "icing": 1467, "herding": 1468, "surrounded by": 1469, "steering wheel": 1470, "stump": 1471, "seafood": 1472, "watercraft": 1473, "vanilla": 1474, "feeding": 1475, "ski lift": 1476, "chopped": 1477, "performing trick": 1478, "town": 1479, "church": 1480, "helping": 1481, "potato salad": 1482, "beak": 1483, "worn": 1484, "spot": 1485, "horn": 1486, "blurry": 1487, "standing beside": 1488, "rib": 1489, "hotel": 1490, "oven door": 1491, "working on": 1492, "seasoned": 1493, "sitting behind": 1494, "melted": 1495, "raised": 1496, "floral": 1497, "fancy": 1498, "lily": 1499, "sea": 1500, "tin": 1501, "dusty": 1502, "perched": 1503, "manhole cover": 1504, "watching": 1505, "bunched": 1506, "riding on": 1507, "pulling": 1508, "edged": 1509, "touching": 1510, "opening": 1511, "school": 1512, "flying in": 1513, "light fixture": 1514, "middle": 1515, "bigger than": 1516, "sitting atop": 1517, "attached to": 1518, "sharp": 1519, "crossing": 1520, "kicking": 1521, "hanging from": 1522, "rooftop": 1523, "ring": 1524, "facing": 1525, "sitting next to": 1526, "skate park": 1527, "pretty": 1528, "on the bottom of": 1529, "holding onto": 1530, "walking along": 1531, "smoothie": 1532, "palace": 1533, "thing": 1534, "cathedral": 1535, "factory": 1536, "bamboo": 1537, "frying pan": 1538, "soft drink": 1539, "wok": 1540, "eraser": 1541, "gender": 1542, "type": 1543, "docked": 1544, "furry": 1545, "glaze": 1546, "mustache": 1547, "pump": 1548, "sugar": 1549, "in between": 1550, "coarse": 1551, "tiled": 1552, "food container": 1553, "family": 1554, "staircase": 1555, "wallpaper": 1556, "dome": 1557, "abundant": 1558, "courtyard": 1559, "hangar": 1560, "snow boot": 1561, "breaking": 1562, "swamp": 1563, "oatmeal": 1564, "guest": 1565, "weathered": 1566, "figure": 1567, "aquarium": 1568, "rusty": 1569, "attic": 1570, "spiky": 1571, "lab coat": 1572, "granola": 1573, "shelter": 1574, "character": 1575, "foil": 1576, "popcorn": 1577, "cabinet door": 1578, "marina": 1579, "team": 1580, "pizza crust": 1581, "twig": 1582, "stick": 1583, "dough": 1584, "lunch": 1585, "gas station": 1586, "sleepy": 1587, "shoe lace": 1588, "moon": 1589, "disposable": 1590, "meadow": 1591, "luggage cart": 1592, "plain": 1593, "tree leaf": 1594, "pork": 1595, "pikachu": 1596, "pokemon": 1597, "muddy": 1598, "cliff": 1599, "symbol": 1600, "sushi": 1601, "weapon": 1602, "cactu": 1603, "dressing": 1604, "champagne": 1605, "underwear": 1606, "massive": 1607, "toilet bowl": 1608, "highway": 1609, "cat food": 1610, "complete": 1611, "damaged": 1612, "overgrown": 1613, "seaweed": 1614, "spiral": 1615, "satellite dish": 1616, "seat belt": 1617, "dog food": 1618, "wii game": 1619, "fire": 1620, "theater": 1621, "feeder": 1622, "loose": 1623, "fountain": 1624, "waving": 1625, "urban": 1626, "breakfast": 1627, "classroom": 1628, "gym": 1629, "sealed": 1630, "alcohol": 1631, "birthday": 1632, "caramel": 1633, "ornate": 1634, "shower door": 1635, "paper container": 1636, "homemade": 1637, "hand": 1638, "magnet": 1639, "french": 1640, "glazed": 1641, "frosted": 1642, "wrinkled": 1643, "quilted": 1644, "entrance": 1645, "waterfall": 1646, "hazy": 1647, "fog": 1648, "mickey mouse": 1649, "arm": 1650, "rippled": 1651, "light switch": 1652, "arched": 1653, "crumpled": 1654, "crowded": 1655, "ingredient": 1656, "frozen": 1657, "used": 1658, "beetle": 1659, "carved": 1660, "bakery": 1661, "banana peel": 1662, "powdered sugar": 1663, "paint": 1664, "busy": 1665, "vine": 1666, "cockpit": 1667, "color": 1668, "shape": 1669, "name tag": 1670, "goal": 1671, "ornament": 1672, "mountain side": 1673, "sea foam": 1674, "_": 1675, "name": 1676, "place": 1677, "size": 1678, "standing in": 1679, "hposition": 1680, "walking on": 1681, "parked in": 1682, "length": 1683, "activity": 1684, "same color": 1685, "weather": 1686, "grazing on": 1687, "parked on": 1688, "antenna": 1689, "pattern": 1690, "standing at": 1691, "height": 1692, "pose": 1693, "throwing": 1694, "material": 1695, "hanging on": 1696, "parked at": 1697, "coming from": 1698, "walking in": 1699, "covered by": 1700, "grazing in": 1701, "hanging off": 1702, "handmade": 1703, "growing behind": 1704, "age": 1705, "covered with": 1706, "balancing on": 1707, "sportactivity": 1708, "mounted to": 1709, "covered in": 1710, "tone": 1711, "pulled by": 1712, "looking for a wave": 1713, "thickness": 1714, "sitting under": 1715, "same material": 1716, "skiing in": 1717, "width": 1718, "printed on": 1719, "tied to": 1720, "approaching": 1721, "coming down": 1722, "dressed in yellow": 1723, "faded": 1724, "state": 1725, "pushed by": 1726, "driving on": 1727, "auditorium": 1728, "wrapped in": 1729, "parked by": 1730, "standing next to": 1731, "reaching for": 1732, "company": 1733, "talking to": 1734, "swinging": 1735, "cleanliness": 1736, "strong": 1737, "selling": 1738, "fatness": 1739, "mixed with": 1740, "walking by": 1741, "walking across": 1742, "floating in": 1743, "reflected in": 1744, "standing near": 1745, "perched on": 1746, "walking up": 1747, "lying in": 1748, "parked next to": 1749, "talking on": 1750, "decorated with": 1751, "observing": 1752, "walking next to": 1753, "looking into": 1754, "at the camera": 1755, "direction": 1756, "salad dressing": 1757, "sleeping on": 1758, "tabby": 1759, "enclosing": 1760, "halved": 1761, "mounted on": 1762, "leaning against": 1763, "standing by": 1764, "playing tenni": 1765, "growing on": 1766, "displayed on": 1767, "playing wius": 1768, "commercial": 1769, "flavor": 1770, "scaffolding": 1771, "surrounding": 1772, "swimming in": 1773, "draped over": 1774, "iced": 1775, "trimmed": 1776, "running on": 1777, "walking through": 1778, "drain": 1779, "hitting": 1780, "connected to": 1781, "brushing tooth": 1782, "none": 1783, "playing baseball": 1784, "traveling on": 1785, "dressed in black": 1786, "growing in": 1787, "weight": 1788, "playing frisbee": 1789, "reflecting in": 1790, "bead": 1791, "painted on": 1792, "dressed in pink": 1793, "leading": 1794, "picking up": 1795, "catching": 1796, "taking picture": 1797, "sitting near": 1798, "in the middle of": 1799, "leaving": 1800, "chained to": 1801, "pushing": 1802, "eating in": 1803, "drinking from": 1804, "parked along": 1805, "topping": 1806, "falling off": 1807, "following": 1808, "keypad": 1809, "smoke stack": 1810, "eating from": 1811, "standing against": 1812, "followed by": 1813, "sliding": 1814, "serving": 1815, "garnish": 1816, "getting on": 1817, "wave": 1818, "looking for": 1819, "a wave": 1820, "running in": 1821, "dressed in white": 1822, "playing in": 1823, "match": 1824, "tying": 1825, "race": 1826, "traveling down": 1827, "crusty": 1828, "broken": 1829, "cracked": 1830, "longer than": 1831, "wrinkly": 1832, "shaggy": 1833, "parked near": 1834, "chasing": 1835, "grabbing": 1836, "close to": 1837, "pub": 1838, "roadside": 1839, "looking out": 1840, "kept in": 1841, "running through": 1842, "reflected on": 1843, "outside": 1844, "taking bath": 1845, "making": 1846, "trying to catch": 1847, "chewing": 1848, "lying next to": 1849, "illuminated": 1850, "looking over": 1851, "flying above": 1852, "wrapped around": 1853, "hardness": 1854, "parked in front of": 1855, "sunglass": 1856, "dressed in brown": 1857, "bubble": 1858, "depth": 1859, "washing": 1860, "flying through": 1861, "walking near": 1862, "ridged": 1863, "garbage": 1864, "walking down": 1865, "wrapped": 1866, "guiding": 1867, "parked behind": 1868, "door frame": 1869, "riding in": 1870, "taking a photo": 1871, "stuck on": 1872, "driving down": 1873, "feathered": 1874, "standing on top of": 1875, "blowing out": 1876, "standing in front of": 1877, "flowered": 1878, "cafe": 1879, "same shape": 1880, "toiletry": 1881, "music": 1882, "cleaning": 1883, "dressed in blue": 1884, "professional": 1885, "upward": 1886, "looking down at": 1887, "christmas light": 1888, "looking through": 1889, "worn on": 1890, "smoking": 1891, "dressed in green": 1892, "powerful": 1893, "eaten": 1894, "going into": 1895, "sitting by": 1896, "along": 1897, "realism": 1898, "wading in": 1899, "piled on": 1900, "stuck in": 1901, "delicious": 1902, "reflected": 1903, "standing around": 1904, "taller than": 1905, "muscular": 1906, "higher than": 1907, "boarding": 1908, "pointing at": 1909, "going through": 1910, "pouring": 1911, "over": 1912, "about to hit": 1913, "hurdle": 1914, "folding": 1915, "cooked in": 1916, "smiling at": 1917, "skiing on": 1918, "turned": 1919, "floating on": 1920, "jumping over": 1921, "lighted": 1922, "standing under": 1923, "smelling": 1924, "looking in": 1925, "playing game": 1926, "light colored": 1927, "half full": 1928, "displayed": 1929, "mayonnaise": 1930, "ceiling light": 1931, "walking with": 1932, "scattered": 1933, "going down": 1934, "taking a picture": 1935, "15": 1936, "stacked on": 1937, "growing near": 1938, "simple": 1939, "dressed in red": 1940, "attached": 1941, "price tag": 1942, "vast": 1943, "hang from": 1944, "biting": 1945, "decorated": 1946, "jumping on": 1947, "parked beside": 1948, "plugged into": 1949, "lined": 1950, "walking into": 1951, "sconce": 1952, "batting": 1953, "bone": 1954, "directional": 1955, "thermometer": 1956, "spinning": 1957, "flying over": 1958, "crane": 1959, "gravy": 1960, "running across": 1961, "lying inside": 1962, "sniffing": 1963, "control panel": 1964, "hugging": 1965, "shadowed": 1966, "glossy": 1967, "steep": 1968, "coming out of": 1969, "dragging": 1970, "upside down": 1971, "collared": 1972, "across from": 1973, "across": 1974, "cushioned": 1975, "seen through": 1976, "sprinkled": 1977, "oriental": 1978, "connected": 1979, "pointy": 1980, "polished": 1981, "hung on": 1982, "tossing": 1983, "making a face": 1984, "adjusting": 1985, "curvy": 1986, "facing left": 1987, "looking at the camera": 1988, "shaded": 1989, "brushing": 1990, "dressed in purple": 1991, "video game": 1992, "looking for food": 1993, "sweet": 1994, "sprinkled on": 1995, "bent": 1996, "walking toward": 1997, "licking": 1998, "jumping off": 1999, "hanging in": 2000, "mounted": 2001, "rain": 2002, "snow shoe": 2003, "hanging out of": 2004, "shining": 2005, "boulder": 2006, "spread": 2007, "milk carton": 2008, "blank": 2009, "salt": 2010, "walking past": 2011, "toothpick": 2012, "portable": 2013, "wired": 2014, "playing basketball": 2015, "looking left": 2016, "rippling": 2017, "taking note": 2018, "woven": 2019, "reflective": 2020, "back": 2021, "splashing": 2022, "life preserver": 2023, "torn": 2024, "money": 2025, "messy": 2026, "working in": 2027, "gas pump": 2028, "salon": 2029, "sitting around": 2030, "scattered on": 2031, "patchy": 2032, "growing next to": 2033, "playing video game": 2034, "skiing down": 2035, "roman": 2036, "jewelry": 2037, "walking to": 2038, "tied around": 2039, "posing with": 2040, "american": 2041, "industrial": 2042, "playing music": 2043, "looking back": 2044, "cafeteria": 2045, "rustic": 2046, "sleeping in": 2047, "hidden by": 2048, "parked alongside": 2049, "skating on": 2050, "grated": 2051, "egg yolk": 2052, "alert": 2053, "shaved": 2054, "horse hoof": 2055, "tree branch": 2056, "supermarket": 2057, "mouth": 2058, "playing cricket": 2059, "shaking hand": 2060, "growing along": 2061, "hilltop": 2062, "texture": 2063, "cast on shadow": 2064, "looking behind": 2065, "suspended": 2066, "sitting with": 2067, "jumping in": 2068, "entering": 2069, "evergreen": 2070, "twisted": 2071, "away": 2072, "looking away": 2073, "looking right": 2074, "misty": 2075, "traffic": 2076, "dressed in orange": 2077, "dressed in gray": 2078, "playing soccer": 2079, "pointing to": 2080, "winter": 2081, "looking upward": 2082, "outdoor": 2083, "manicured": 2084, "barren": 2085, "foreign": 2086, "turbine": 2087, "bug": 2088, "tongue": 2089, "textured": 2090, "rugged": 2091, "cricket": 2092, "forward": 2093, "looking forward": 2094, "pointing upward": 2095, "elongated": 2096, "designed": 2097, "buying": 2098, "potato chip": 2099, "anchovy": 2100, "eating at": 2101, "drawn on": 2102, "fishing pole": 2103, "kissing": 2104, "sitting inside": 2105, "served on": 2106, "slicing": 2107, "ivory": 2108, "blooming": 2109, "hummus": 2110, "towing": 2111, "merchandise": 2112, "in the center of": 2113, "buffet": 2114, "beyond": 2115, "accessory": 2116, "riding boot": 2117, "meatball": 2118, "tattoo": 2119, "coffee shop": 2120, "sticking out of": 2121, "christmas": 2122, "forested": 2123, "ga": 2124, "sunlit": 2125, "hospital": 2126, "decorated by": 2127, "obstacle": 2128, "decorating": 2129, "cookie dough": 2130, "playing at": 2131, "photographing": 2132, "robot": 2133, "cotton candy": 2134, "at the end of": 2135, "ornamental": 2136, "pizza shop": 2137, "pill": 2138, "scrambled": 2139, "banana bunch": 2140, "office supply": 2141, "alongside": 2142, "recessed": 2143, "grocery": 2144, "olive oil": 2145, "orchard": 2146, "amusement park": 2147, "pantry": 2148, "lounge": 2149, "picnic": 2150, "touchpad": 2151, "foamy": 2152, "blood": 2153, "eiffel tower": 2154, "shining through": 2155, "looking toward": 2156, "sewn on": 2157, "lobby": 2158, "nutella": 2159, "fallen": 2160, "skin": 2161, "spraying": 2162, "cappuccino": 2163, "wispy": 2164, "pillar": 2165, "chinese": 2166, "slanted": 2167, "packed": 2168, "displayed in": 2169, "vinegar": 2170, "squatting": 2171, "shaving cream": 2172, "drawn": 2173, "in the back of": 2174, "power": 2175, "deciduou": 2176, "growing from": 2177, "funny": 2178, "mint": 2179, "pesto": 2180, "winding": 2181, "placed on": 2182, "written": 2183, "tangled": 2184, "crisp": 2185, "egg carton": 2186, "oversized": 2187, "carpeted": 2188, "protective": 2189, "chipped": 2190, "juicy": 2191, "palm": 2192, "burning": 2193, "fluorescent": 2194, "pine": 2195, "barbed": 2196, "cinnamon": 2197, "angled": 2198, "formal": 2199, "groomed": 2200, "oreo": 2201, "pale": 2202, "leg": 2203, "at the edge of": 2204, "shingled": 2205, "front": 2206, "vacant": 2207, "athletic": 2208, "snoopy": 2209, "worn around": 2210, "the same direction": 2211, "looking": 2212, "in mirror": 2213, "backward": 2214, "shorter than": 2215, "out": 2216, "growing by": 2217, "coffee bean": 2218, "cooking oil": 2219, "ahead": 2220, "neck": 2221, "snow flake": 2222, "browned": 2223, "downward": 2224, "at camera": 2225, "mountain peak": 2226, "the camera": 2227, "pocket watch": 2228, "citru": 2229, "paw": 2230, "chubby": 2231, "creamy": 2232, "larg": 2233, "sideway": 2234, "tropical": 2235, "wooded": 2236, "cordless": 2237, "telephone": 2238, "kimono": 2239, "lower": 2240, "melting": 2241, "abandoned": 2242, "coral": 2243, "artificial": 2244, "face": 2245, "ruffled": 2246, "braided": 2247, "tight": 2248, "smaller than": 2249, "knotted": 2250, "polar": 2251, "diamond": 2252, "neon": 2253, "translucent": 2254, "powdered": 2255, "analog": 2256, "cemetery": 2257, "incomplete": 2258, "scarce": 2259, "mowed": 2260, "typical": 2261, "monster": 2262, "egg white": 2263, "hibiscu": 2264, "abstract": 2265, "safety": 2266, "crumbled": 2267, "unoccupied": 2268, "vinyl": 2269, "crashing": 2270, "inflatable": 2271, "tree trunk": 2272, "inflated": 2273, "knit": 2274, "blowing": 2275, "jagged": 2276, "curious": 2277, "packaged": 2278, "tilted": 2279, "pastel": 2280, "fenced": 2281, "crossed": 2282, "support": 2283, "uneven": 2284, "corded": 2285, "clumped": 2286, "looking ahead": 2287, "looking outside": 2288, "taking a photograph": 2289, "dressed in tan": 2290, "polo": 2291, "playing football": 2292, "playing volleyball": 2293, "27": 2294, "facing right": 2295, "paneled": 2296, "looking in the mirror": 2297, "dressed in maroon": 2298, "floppy": 2299, "the shoe": 2300, "looking for the shoe": 2301, "face expression": 2302, "18": 2303, "looking straight": 2304, "looking downward": 2305, "dressed in light blue": 2306, "in the mirror": 2307, "31": 2308, "pulled back": 2309, "looking sideway": 2310, "facing front": 2311, "pointing up": 2312, "upper": 2313, "hollow": 2314, "sculpted": 2315, "looking for the luggage": 2316, "taking photo": 2317, "sport": 2318, "patched": 2319, "16": 2320, "facing away": 2321, "24": 2322, "25": 2323, "the luggage": 2324, "looking for wave": 2325, "looking for fish": 2326, "discolored": 2327, "crouched": 2328, "vibrant": 2329, "dressed in gold": 2330, "within": 2331, "dressed in beige": 2332, "dressed in khaki": 2333, "on the surface of": 2334, "peeling": 2335}, "idx_to_arg": ["brown", "ground", "blue", "large", "wall", "near", "true", "refrigerator", "small", "aluminum", "fence", "concrete", "white", "car", "orange", "off", "helicopter", "on", "cabinet", "this", "bed", "dense", "sparse", "narrow", "river", "wide", "glass", "glasses", "round", "wire", "cloth", "pants", "leather", "black and white", "pen", "colorful", "blond", "performer", "to the left of", "man", "brunette", "lush", "field", "tree", "bare", "jacket", "cotton", "male", "ball", "soccer player", "female", "teal", "dress shirt", "gray", "sofa", "furniture", "right", "container", "plastic", "left", "black", "towel", "long sleeved", "shirt", "sleeveless", "window", "paper", "napkin", "bottle", "cup", "hair", "red", "top", "umbrella", "bottom", "tan", "bag", "purple", "unpeeled", "in front of", "fruit", "peeled", "porcelain", "short sleeved", "shoe", "pink", "metal", "clock", "chandelier", "frisbee", "yellow", "helmet", "soccer ball", "traffic light", "player", "next to", "rough", "sand", "wet", "smooth", "long", "short", "closed", "door", "open", "new", "train", "old", "grass", "tall", "painting", "sweatshirt", "young", "pedestrian", "park", "scene", "beach", "square", "table", "wood", "marshmallow", "athlete", "cake", "waiting", "catcher", "playing", "goat", "sheep", "silver", "oven", "above", "microwave", "paper towel", "bird", "resting", "skating", "person", "looking up", "riding", "tv stand", "inside", "dvd", "girl", "sock", "clothing", "dark", "blouse", "navy", "hat", "sign", "airplane", "cutting board", "appliance", "shelf", "coffee table", "water bottle", "dessert", "mat", "farm", "bus", "to the right of", "cat", "road", "chair", "green", "light brown", "pillow", "eggplant", "box", "vehicle", "sausage", "cooked", "woman", "flower", "cow", "caucasian", "stainless steel", "tennis ball", "brick", "looking down", "standing", "walking", "flower pot", "racket", "surfboard", "knife", "skateboarding", "skateboarder", "phone", "device", "framed", "monitor", "outdoors", "indoors", "trash can", "sink", "giraffe", "staring at", "false", "animal", "rhino", "dark blue", "safety jacket", "toilet", "sitting", "happy", "running", "dirty", "dirt", "dark brown", "clean", "full", "drink", "empty", "keyboard", "horse", "building", "behind", "dry", "pasture", "metallic", "lamp", "purse", "mug", "bedroom", "bathroom", "uncomfortable", "comfortable", "ugly", "sky", "cloudy", "beautiful", "life jacket", "desk", "sturdy", "couch", "clear", "raw", "vegetable", "picture", "hanging above", "blanket", "forest", "snowy", "mouse pad", "food", "thin", "monkey", "artwork", "under", "skateboard", "on top of", "television", "skinny", "fat", "spatula", "cooking utensil", "warm", "pan", "bush", "gold", "necklace", "can", "remote control", "holding", "house", "berry", "dresser", "wristband", "bookcase", "reading", "sleeping", "speaker", "boat", "sidewalk", "posing", "bending", "telephone pole", "toaster", "sitting beside", "coffee maker", "table lamp", "gentleman", "baseball mitt", "mirror", "fire truck", "bridge", "ambulance", "rug", "coat", "sandwich", "tea", "thick", "book", "light blue", "stone", "floor", "hardwood", "asphalt", "cobblestone", "cupcake", "rainbow colored", "carrot", "leafless", "bucket", "flag", "talking", "electronic", "rope", "tire", "below", "folding chair", "oil", "snowboarder", "shorts", "truck", "tractor", "umpire", "fried", "faucet", "chrome", "notebook", "asian", "utensil", "elephant", "jersey", "baseball", "vase", "sitting in", "she", "crown", "tank top", "fork", "palm tree", "boy", "adidas", "bowl", "rocky", "mountain", "grassy", "wooden", "sweater", "laptop", "little", "mother", "office chair", "grape", "cut", "stove", "stadium", "huge", "parked", "broccoli", "lettuce", "pot", "curtain", "flat", "van", "plate", "beige", "frame", "driving", "cake stand", "bear", "calculator", "drape", "shopping center", "dog", "coffee cup", "tape", "pig", "poster", "chicken", "greasy", "pizza", "stained", "cord", "suv", "sliced", "apple", "bench", "iron", "unlit", "leafy", "staring", "drinking", "hot dog", "rectangular", "polo shirt", "basket", "banana", "kitten", "playing with", "luggage", "pole", "traffic sign", "adida", "bat", "nike", "bean", "cylindrical", "motorcycle", "rubber", "entertainment center", "sheet", "wii controller", "using", "jet", "heel", "bottle cap", "low", "high", "blind", "zebra", "soft", "controller", "cell phone", "cabbage", "scissors", "toilet seat", "spoon", "cream colored", "counter", "cloud", "ripe", "camera", "fire hydrant", "jumping", "overcast", "rainy", "sitting on", "sandy", "utensil holder", "marker", "cauliflower", "dress", "old fashioned", "modern", "suit", "heater", "balloon", "pear", "striped", "store", "antique", "drawer", "bright", "logo", "countertop", "underneath", "cooking", "straight", "curly", "trash", "tie", "lying on top of", "tray", "light", "kite", "toothbrush", "toilet paper", "resting on", "tenni", "jeans", "denim", "suitcase", "stuffed bear", "toy", "doll", "cap", "dull", "smiling", "fine", "deer", "granite", "snack", "digital", "storage box", "glove", "soap dispenser", "computer mouse", "ski", "restaurant", "market", "having meeting", "skier", "olive", "larger than", "wine", "beer", "powder", "batter", "lying", "t-shirt", "lady", "sad", "candle", "leaning on", "mixer", "cheese", "fast food", "hamburger", "rice", "pasta", "label", "beside", "lawn", "toilet lid", "printer", "bread", "closet", "in", "toothpaste", "train station", "shower", "shut", "pavement", "radio", "computer", "sitting in front of", "bushy", "cream", "pepperoni", "wildflower", "brownie", "grouped", "waffle", "unhappy", "bookshelf", "tissue box", "puppy", "pipe", "snow", "tent", "folded", "sign post", "watch", "runway", "steel", "crosswalk", "bike", "dock", "unhealthy", "healthy", "side table", "cupboard", "wine bottle", "yes", "nightstand", "no", "duck", "letter", "number", "star", "antelope", "lamb", "cage", "mud", "kitchen", "dragon", "kiwi", "peach", "statue", "taxi", "sandal", "parrot", "cone", "bun", "meat", "onion", "pepper", "object", "backpack", "shield", "paddle", "ladder", "boar", "desk lamp", "sweet potato", "by", "child", "donut", "dip", "seagull", "coach", "tomato", "scarf", "tablecloth", "snowboard", "goggles", "teddy bear", "owl", "pigeon", "screen", "knee pad", "fake", "saucer", "shrimp", "mushroom", "hose", "boot", "rubber duck", "walnut", "dinosaur", "leopard", "lion", "collar", "baseball bat", "chimney", "floor lamp", "potato", "dishwasher", "magazine", "bagel", "with", "bracelet", "surfer", "wetsuit", "parachute", "lemon", "ice", "parking meter", "clothe", "jar", "gift", "router", "peanut", "moss", "trailer", "bicycle", "game controller", "cart", "worker", "egg", "stop sign", "guitar", "drum", "dvd player", "briefcase", "spectator", "microwave oven", "passenger", "spray can", "sailboat", "blender", "hair clip", "train car", "maroon", "appetizer", "strawberry", "dining table", "hippo", "pancake", "bunny", "frog", "heart", "skiing", "mattress", "steam", "smoke", "leggings", "tablet", "computer monitor", "soap", "packet", "bell", "dish drainer", "american flag", "mustard", "sculpture", "milk", "coffee", "swan", "ottoman", "pliers", "flamingo", "microphone", "dispenser", "coffee pot", "mango", "baby", "armchair", "word", "canister", "parent", "water", "lipstick", "cd", "pencil", "soap dish", "camel", "cracker", "wine glass", "fry", "street sign", "light bulb", "lock", "butter knife", "cyclist", "of", "salt shaker", "garland", "cheetah", "cheesecake", "soup", "scooter", "ostrich", "carriage", "photographer", "stroller", "bandage", "football", "toddler", "bee", "toaster oven", "diaper", "rabbit", "uniform", "comforter", "pillowcase", "pepper shaker", "swimmer", "sprinkle", "eating", "fresh", "polar bear", "butterfly", "kettle", "cigarette", "waste basket", "cheese cube", "piano", "candy", "blazer", "bread box", "figurine", "end table", "ipod", "branch", "apron", "donkey", "checkered", "cucumber", "eagle", "lizard", "bird cage", "street", "headband", "buoy", "post", "notepad", "biker", "adult", "pastry", "salad", "vest", "serving tray", "tiger", "tangerine", "bathtub", "skyscraper", "wolf", "cookie", "tea kettle", "moose", "father", "broom", "snake", "tissue", "tool", "peacock", "lighthouse", "shuttle", "snowboarding", "dragonfly", "snowsuit", "cake slouse", "guy", "tower", "castle", "parking sign", "outfit", "sugar packet", "shopping cart", "pizza slice", "hotel room", "plush", "tofu", "battery", "hook", "cooker", "skirt", "picnic table", "wheelchair", "almond", "muffin", "dumpster", "ketchup", "bouquet", "student", "soldier", "clock tower", "bar stool", "curved", "melon", "juice", "net", "coconut", "jumpsuit", "chess piece", "whale", "bedspread", "swimsuit", "penguin", "mannequin", "beet", "squash", "radiator", "dolphin", "chef", "toolbox", "console", "decorative", "seal", "charger", "sneaker", "cable", "plant", "sack", "wallet", "lobster", "goose", "vending machine", "planter", "spider", "step", "unripe", "cane", "office", "ice cream", "calf", "sponge", "earring", "heavy", "shark", "athletic shoe", "dream catcher", "panda bear", "stuffed animal", "entree", "minivan", "rock", "paint brush", "ice-cream cone", "kangaroo", "nut", "pretzel", "bronze", "toilet brush", "gun", "sword", "shopping bag", 